{"/FFXIVDutyPusher/de/about/":{"data":{"":"","urheberrechtshinweis-und-haftungsausschluss#Urheberrechtshinweis und Haftungsausschluss":"Urheberrechtshinweis Open-Source-Lizenz Dieses Plugin ist Open Source unter der AGPL-3.0-Lizenz. Sie können dieses Plugin frei verwenden, modifizieren und verteilen, vorausgesetzt, Sie halten sich an die Bedingungen der AGPL-3.0-Lizenz.\nWebsite-Generierung und Thema Diese Website wird von Hugo generiert, und das Thema basiert auf hextra.\nPush-Kanäle Die von diesem Plugin verwendeten Push-Kanäle werden von ihren jeweiligen Plattformen/Dienstleistern bereitgestellt, darunter Bark, PushDeer und Telegram Bot. Diese Plattformen/Dienstleister behalten unabhängige Urheberrechte und Verantwortlichkeiten für ihre Dienste.\nFINAL FANTASY Marke FINAL FANTASY ist eine eingetragene Marke von Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Alle Rechte vorbehalten. Wir stehen in keiner Verbindung zu SQUARE ENIX CO., LTD.\nHaftungsausschluss Risiken bei der Verwendung des Plugins Durch die Verwendung dieses Plugins bestätigen und akzeptieren Sie die Nutzungsbedingungen von Final Fantasy XIV (FFXIV). Bitte beachten Sie, dass dieses Plugin technisch gesehen die Nutzungsbedingungen von FFXIV verletzen könnte, auch wenn wir keine automatisierten Operationen oder Modifikationen am Spiel vornehmen. Sie tragen alle Risiken, die mit der Verwendung dieses Plugins verbunden sind, einschließlich, aber nicht beschränkt auf Kontosperrung, Datenverlust oder andere Konsequenzen.\nHaftungsbeschränkung Die Entwickler und Mitwirkenden dieses Plugins haften nicht für direkte oder indirekte Schäden, die durch die Verwendung dieses Plugins entstehen, einschließlich, aber nicht beschränkt auf Kontosperrung, Datenverlust, Geräteschäden oder andere rechtliche oder finanzielle Haftungen.\nVerwendung auf eigene Gefahr Durch die Verwendung dieses Plugins bestätigen und akzeptieren Sie die oben genannten Risiken und erklären sich damit einverstanden, alle möglichen Konsequenzen selbst zu tragen. Wir empfehlen, das Plugin vorsichtig zu verwenden und die Nutzungsbedingungen von FFXIV einzuhalten.","über-den-entwickler#Über den Entwickler":"Hallo, ich bin MorCherlf. Ich bin Programmierer, Gamer, Musikenthusiast, Furry und mehr…\nDies ist mein erstes Dalamud-Plugin. Wenn Sie Vorschläge oder Fragen haben, können Sie gerne ein Issue oder einen Pull Request auf GitHub einreichen.\nWenn Sie Fragen haben, können Sie mich auch per E-Mail erreichen.","über-dutypusher#Über DutyPusher":"DutyPusher ist ein Open-Source-Dalamud-Plugin, das von MorCherlf für Final Fantasy XIV (FFXIV) entwickelt wurde. Es soll Spielern helfen, sich von ihren Computern zu entspannen, während sie auf die Warteschlange für Dungeons warten. Durch die Nutzung mehrerer erweiterbarer Push-Kanäle können Spieler sofortige Benachrichtigungen erhalten, wenn ihre Warteschlange aufpoppt, und sicherstellen, dass sie keinen Dungeon verpassen.\nHauptmerkmale\nUnterstützung für mehrere Push-Kanäle: Derzeit werden Bark, PushDeer und Telegram Bot offizielle APIs unterstützt, mit Plänen, in Zukunft weitere Push-Kanäle hinzuzufügen. Sofortige Benachrichtigungen: Wenn Ihre Dungeon-Warteschlange aufpoppt, sendet DutyPusher sofort eine Benachrichtigung an Ihr Gerät. Einfach zu bedienen: Einfache Einrichtung ermöglicht es Ihnen, sofort loszulegen. Anpassbare Optionen: Unterstützt benutzerdefinierte Benachrichtigungstöne und Sofortbenachrichtigungen (Bark). Vollständig Open Source: DutyPusher ist vollständig Open Source. Sie können Ihren eigenen Fork erstellen oder uns einen Pull Request auf GitHub senden. So sicher wie möglich: DutyPusher interagiert nicht mit dem Spielserver oder modifiziert/operiert das Spiel in irgendeiner Weise direkt. Außer beim Senden von Benachrichtigungen, was Netzwerkanfragen an die jeweiligen Push-Kanal-Server erfordert, werden keine Informationen gesammelt, aufgezeichnet oder gespeichert. "},"title":"Über"},"/FFXIVDutyPusher/de/docs/":{"data":{"":"","plugin-einstellungen#Plugin-Einstellungen":"Sie können die DutyPusher-Einstellungsseite auf eine der folgenden Arten öffnen:\nKlicken Sie auf die DutyPusher-Einstellungsschaltfläche im Plugin-Center. Geben Sie den Befehl /dutypusher im Spiel ein. Wählen Sie zunächst den Push-Kanal aus, den Sie verwenden möchten, aus dem Dropdown-Menü.\nFüllen Sie dann das erforderliche Token/URL/Schlüssel für den ausgewählten Push-Kanal aus, aktivieren Sie das Plugin und speichern Sie die Einstellungen, um es zu verwenden.\nNach der Konfiguration des Push-Kanals können Sie den Aktivierungsstatus von DutyPusher in der DTR-Leiste in der oberen rechten Ecke der Hauptoberfläche des Spiels überprüfen. Klicken Sie auf das Status-Symbol, um es ein- oder auszuschalten.","push-kanal-konfiguration#Push-Kanal-Konfiguration":"Derzeit unterstützt DutyPusher die folgenden Push-Kanäle: Bark, PushDeer und Telegram Bot Offizielle API.\nWenn Sie Unterstützung für eine neue Plattform hinzufügen möchten, reichen Sie bitte ein Issue in diesem Repository ein.\nRepo-Links: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nWenn Sie beim Verwenden dieses Plugins auf Probleme stoßen, senden Sie bitte kein Feedback an einen Push-Kanal/Plattform.\nTeilen Sie Ihre Kanal-URL/Schlüssel nicht mit anderen!\nBark-Konfiguration Suchen Sie im App Store nach Bark und installieren Sie es.\nÖffnen Sie die Bark-App, klicken Sie auf Gerät registrieren und erlauben Sie das Senden von Benachrichtigungen.\nKopieren Sie die erste URL in Bark und fügen Sie sie in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nOptionale Konfigurationen\nSie können Zeitkritische Benachrichtigungen in den Plugin-Einstellungen aktivieren, um Push-Benachrichtigungen zu erhalten, auch wenn Ihr Gerät im Fokusmodus ist. Klicken Sie in Bark auf Alle Sounds anzeigen und importieren Sie diesen Duty-Sound. Stellen Sie sicher, dass die Datei in ff14.caf umbenannt wird, bevor Sie sie importieren. PushDeer-Konfiguration iOS/iPadOS (14+)\nVerwenden Sie Ihre Systemkamera, um den App-Clip-Code unten zu scannen, um PushDeer zu verwenden.\nAlternativ können Sie im App Store nach PushDeer suchen und es installieren.\nÖffnen Sie die PushDeer-App, gehen Sie zum Geräte-Tab, klicken Sie auf das Plus (+) in der oberen rechten Ecke und erlauben Sie das Senden von Benachrichtigungen.\nGehen Sie zum Schlüssel-Tab in PushDeer, kopieren Sie Ihren Schlüssel und fügen Sie ihn in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nTelegram Bot Offizielle API-Konfiguration Offizielle Dokumentation: Telegram Bot API\nDie folgenden Schritte können sich jederzeit ändern. Bitte beziehen Sie sich auf die offizielle Telegram-Dokumentation für die neuesten Anweisungen.\nErstellen eines Bots Verwenden Sie Ihr Telegram-Konto, um den Befehl /start an @BotFather zu senden. Senden Sie dann den Befehl /newbot und folgen Sie den Anweisungen, um einen Namen und einen Benutzernamen für Ihren Bot festzulegen. Sie erhalten detaillierte Informationen über Ihren Bot, einschließlich eines Links zu Ihrem Bot (beginnend mit t.me/) und eines Tokens (beginnend mit Zahlen: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Plugin-Einstellungen Senden Sie den Befehl /start an Ihren neu erstellten Bot in Telegram. Kopieren Sie das von BotFather bereitgestellte Token und fügen Sie es in das Token-Feld in den DutyPusher-Einstellungen ein. Klicken Sie auf Chat-ID erhalten und warten Sie, bis die Chat-ID automatisch ausgefüllt wird. Sobald die Chat-ID abgerufen wurde, klicken Sie auf Test, um zu bestätigen, dass Sie eine Nachricht von Ihrem Bot in Telegram erhalten können. Wenn alles funktioniert, klicken Sie auf Speichern, um es zu verwenden. Tip\nWenn das Plugin Ihre Chat-ID nicht automatisch abrufen kann, versuchen Sie die folgenden Schritte:\nStellen Sie sicher, dass das Token korrekt eingegeben wurde. Senden Sie eine beliebige Nachricht an Ihren Bot und versuchen Sie, die Chat-ID erneut abzurufen. Wenn die obigen Schritte nicht funktionieren:\nÖffnen Sie Ihren Browser und besuchen Sie die folgende URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Hinweis: Ersetzen Sie $YOUR_BOT_TOKEN_HERE mit Ihrem Bot-Token. Suchen Sie das Feld message -\u003e chat -\u003e id in der JSON-Antwort und kopieren Sie es in das Chat-ID-Feld in den Plugin-Einstellungen. "},"title":"Einstellungsanleitung"},"/FFXIVDutyPusher/de/faq/":{"data":{"":" F: Warum erhalte ich keine Push-Benachrichtigungen?\nA: Bitte überprüfen Sie, ob der Push-Kanal korrekt konfiguriert ist, und stellen Sie sicher, dass Ihr Gerät Benachrichtigungen zulässt.\nF: Wie deinstalliere ich das Plugin?\nA: Suchen Sie DutyPusher im Plugin-Center, deaktivieren Sie es und klicken Sie dann auf die Schaltfläche Löschen.\nF: Können Sie Unterstützung für [XX] Push-Kanal hinzufügen?\nA: Bitte reichen Sie ein Issue in diesem Repository mit dem Namen/der Plattform des Push-Kanals ein, und wir werden versuchen, es dem Plugin hinzuzufügen."},"title":"FAQ"}}