{"/FFXIVDutyPusher/about/":{"data":{"":"","about-dutypusher#About DutyPusher":"DutyPusher is an open-source Dalamud plugin developed by MorCherlf for Final Fantasy XIV (FFXIV). It aims to help players relax away from their computers while waiting in queue for dungeons. By utilizing multiple extensible push channels, players can receive immediate notifications when their queue pops, ensuring they never miss a dungeon.\nKey Features\nMultiple Push Channels Supported: Currently supports Bark, PushDeer, and Telegram Bot official APIs, with plans to expand to more push channels in the future. Instant Notifications: When your dungeon queue pops, DutyPusher will immediately send a notification to your device. Easy to Use: Simple setup allows you to start using it right away. Customizable Options: Supports custom notification sounds and instant notifications (Bark). Fully Open Source: DutyPusher is fully open source. You can create your own fork or submit a Pull Request to us. As Safe as Possible: DutyPusher does not interact with the game server or directly modify/operate the game in any way. Except for sending notifications, which requires network requests to the respective push channel servers, it does not collect, record, or store any information. ","about-the-developer#About the Developer":"Hello, I’m MorCherlf. I’m a programmer, gamer, music enthusiast, Furry, and more…\nThis is my first Dalamud plugin. If you have any suggestions or questions, feel free to submit an Issue or Pull Request on GitHub.\nIf you have any questions, you can also reach me via email.","copyright-and-disclaimer#Copyright and Disclaimer":"Copyright Notice Open Source License This plugin is open source under the AGPL-3.0 License. You are free to use, modify, and distribute this plugin, provided you comply with the terms of the AGPL-3.0 license.\nWebsite Generation and Theme This website is generated by Hugo, and the theme is based on hextra.\nPush Channels The push channels used by this plugin are provided by their respective platforms/service providers, including but not limited to Bark, PushDeer, and Telegram Bot. These platforms/service providers retain independent intellectual property rights and responsibilities for their services.\nFINAL FANTASY Trademark FINAL FANTASY is a registered trademark of Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. All rights reserved. We are not affiliated with SQUARE ENIX CO., LTD.\nDisclaimer Plugin Usage Risks By using this plugin, you acknowledge and agree to the Terms of Service of Final Fantasy XIV (FFXIV). Please note that, technically, this plugin may violate FFXIV’s Terms of Service, even though we do not perform any automated operations or modifications to the game. You assume all risks associated with using this plugin, including but not limited to account suspension, data loss, or other consequences.\nLimitation of Liability The developers and contributors of this plugin are not responsible for any direct or indirect damages arising from the use of this plugin, including but not limited to game account suspension, data loss, device damage, or other legal or financial liabilities.\nUse at Your Own Risk By using this plugin, you acknowledge and accept the risks mentioned above and agree to bear all possible consequences. We recommend using the plugin cautiously and adhering to FFXIV’s Terms of Service."},"title":"About"},"/FFXIVDutyPusher/de/":{"data":{"":"","hinweis#Hinweis":"Um die Sicherheit Ihres Kontos zu gewährleisten, vermeiden Sie bitte die Verwendung von Repository-Links und Plugins aus nicht vertrauenswürdigen Quellen.\nDie Verwendung von Drittanbieter-Plugins kann dazu führen, dass Ihr Konto gesperrt wird. Bitte seien Sie sich dessen bewusst, bevor Sie das Plugin verwenden.\nTeilen Sie Ihre Plugin-Konfigurationsdatei nicht mit anderen. Sie sind allein verantwortlich für eventuelle Verluste, die dadurch entstehen.\nWenn Sie beim Verwenden dieses Plugins auf Probleme stoßen, senden Sie bitte kein Feedback an Dalamud.\nDownload-Zähler in Dalamud: ","was-ist-dutypusher#Was ist DutyPusher?":"Dies ist ein Final Fantasy XIV Dalamud-Plugin.\nWenn Sie dieses Plugin aktivieren und einen Push-Kanal konfigurieren, sendet es eine Benachrichtigung an Ihr Gerät, wenn ein Dungeon in der Warteschlange bereit ist."},"title":"DutyPusher"},"/FFXIVDutyPusher/de/about/":{"data":{"":"","urheberrechtshinweis-und-haftungsausschluss#Urheberrechtshinweis und Haftungsausschluss":"Urheberrechtshinweis Open-Source-Lizenz Dieses Plugin ist Open Source unter der AGPL-3.0-Lizenz. Sie können dieses Plugin frei verwenden, modifizieren und verteilen, vorausgesetzt, Sie halten sich an die Bedingungen der AGPL-3.0-Lizenz.\nWebsite-Generierung und Thema Diese Website wird von Hugo generiert, und das Thema basiert auf hextra.\nPush-Kanäle Die von diesem Plugin verwendeten Push-Kanäle werden von ihren jeweiligen Plattformen/Dienstleistern bereitgestellt, darunter Bark, PushDeer und Telegram Bot. Diese Plattformen/Dienstleister behalten unabhängige Urheberrechte und Verantwortlichkeiten für ihre Dienste.\nFINAL FANTASY Marke FINAL FANTASY ist eine eingetragene Marke von Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Alle Rechte vorbehalten. Wir stehen in keiner Verbindung zu SQUARE ENIX CO., LTD.\nHaftungsausschluss Risiken bei der Verwendung des Plugins Durch die Verwendung dieses Plugins bestätigen und akzeptieren Sie die Nutzungsbedingungen von Final Fantasy XIV (FFXIV). Bitte beachten Sie, dass dieses Plugin technisch gesehen die Nutzungsbedingungen von FFXIV verletzen könnte, auch wenn wir keine automatisierten Operationen oder Modifikationen am Spiel vornehmen. Sie tragen alle Risiken, die mit der Verwendung dieses Plugins verbunden sind, einschließlich, aber nicht beschränkt auf Kontosperrung, Datenverlust oder andere Konsequenzen.\nHaftungsbeschränkung Die Entwickler und Mitwirkenden dieses Plugins haften nicht für direkte oder indirekte Schäden, die durch die Verwendung dieses Plugins entstehen, einschließlich, aber nicht beschränkt auf Kontosperrung, Datenverlust, Geräteschäden oder andere rechtliche oder finanzielle Haftungen.\nVerwendung auf eigene Gefahr Durch die Verwendung dieses Plugins bestätigen und akzeptieren Sie die oben genannten Risiken und erklären sich damit einverstanden, alle möglichen Konsequenzen selbst zu tragen. Wir empfehlen, das Plugin vorsichtig zu verwenden und die Nutzungsbedingungen von FFXIV einzuhalten.","über-den-entwickler#Über den Entwickler":"Hallo, ich bin MorCherlf. Ich bin Programmierer, Gamer, Musikenthusiast, Furry und mehr…\nDies ist mein erstes Dalamud-Plugin. Wenn Sie Vorschläge oder Fragen haben, können Sie gerne ein Issue oder einen Pull Request auf GitHub einreichen.\nWenn Sie Fragen haben, können Sie mich auch per E-Mail erreichen.","über-dutypusher#Über DutyPusher":"DutyPusher ist ein Open-Source-Dalamud-Plugin, das von MorCherlf für Final Fantasy XIV (FFXIV) entwickelt wurde. Es soll Spielern helfen, sich von ihren Computern zu entspannen, während sie auf die Warteschlange für Dungeons warten. Durch die Nutzung mehrerer erweiterbarer Push-Kanäle können Spieler sofortige Benachrichtigungen erhalten, wenn ihre Warteschlange aufpoppt, und sicherstellen, dass sie keinen Dungeon verpassen.\nHauptmerkmale\nUnterstützung für mehrere Push-Kanäle: Derzeit werden Bark, PushDeer und Telegram Bot offizielle APIs unterstützt, mit Plänen, in Zukunft weitere Push-Kanäle hinzuzufügen. Sofortige Benachrichtigungen: Wenn Ihre Dungeon-Warteschlange aufpoppt, sendet DutyPusher sofort eine Benachrichtigung an Ihr Gerät. Einfach zu bedienen: Einfache Einrichtung ermöglicht es Ihnen, sofort loszulegen. Anpassbare Optionen: Unterstützt benutzerdefinierte Benachrichtigungstöne und Sofortbenachrichtigungen (Bark). Vollständig Open Source: DutyPusher ist vollständig Open Source. Sie können Ihren eigenen Fork erstellen oder uns einen Pull Request auf GitHub senden. So sicher wie möglich: DutyPusher interagiert nicht mit dem Spielserver oder modifiziert/operiert das Spiel in irgendeiner Weise direkt. Außer beim Senden von Benachrichtigungen, was Netzwerkanfragen an die jeweiligen Push-Kanal-Server erfordert, werden keine Informationen gesammelt, aufgezeichnet oder gespeichert. "},"title":"Über"},"/FFXIVDutyPusher/de/docs/":{"data":{"":"","plugin-einstellungen#Plugin-Einstellungen":"Sie können die DutyPusher-Einstellungsseite auf eine der folgenden Arten öffnen:\nKlicken Sie auf die DutyPusher-Einstellungsschaltfläche im Plugin-Center. Geben Sie den Befehl /dutypusher im Spiel ein. Wählen Sie zunächst den Push-Kanal aus, den Sie verwenden möchten, aus dem Dropdown-Menü.\nFüllen Sie dann das erforderliche Token/URL/Schlüssel für den ausgewählten Push-Kanal aus, aktivieren Sie das Plugin und speichern Sie die Einstellungen, um es zu verwenden.\nNach der Konfiguration des Push-Kanals können Sie den Aktivierungsstatus von DutyPusher in der DTR-Leiste in der oberen rechten Ecke der Hauptoberfläche des Spiels überprüfen. Klicken Sie auf das Status-Symbol, um es ein- oder auszuschalten.","push-kanal-konfiguration#Push-Kanal-Konfiguration":"Derzeit unterstützt DutyPusher die folgenden Push-Kanäle: Bark, PushDeer und Telegram Bot Offizielle API.\nWenn Sie Unterstützung für eine neue Plattform hinzufügen möchten, reichen Sie bitte ein Issue in diesem Repository ein.\nRepo-Links: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nWenn Sie beim Verwenden dieses Plugins auf Probleme stoßen, senden Sie bitte kein Feedback an einen Push-Kanal/Plattform.\nTeilen Sie Ihre Kanal-URL/Schlüssel nicht mit anderen!\nBark-Konfiguration Suchen Sie im App Store nach Bark und installieren Sie es.\nÖffnen Sie die Bark-App, klicken Sie auf Gerät registrieren und erlauben Sie das Senden von Benachrichtigungen.\nKopieren Sie die erste URL in Bark und fügen Sie sie in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nOptionale Konfigurationen\nSie können Zeitkritische Benachrichtigungen in den Plugin-Einstellungen aktivieren, um Push-Benachrichtigungen zu erhalten, auch wenn Ihr Gerät im Fokusmodus ist. Klicken Sie in Bark auf Alle Sounds anzeigen und importieren Sie diesen Duty-Sound. Stellen Sie sicher, dass die Datei in ff14.caf umbenannt wird, bevor Sie sie importieren. PushDeer-Konfiguration iOS/iPadOS (14+)\nVerwenden Sie Ihre Systemkamera, um den App-Clip-Code unten zu scannen, um PushDeer zu verwenden.\nAlternativ können Sie im App Store nach PushDeer suchen und es installieren.\nÖffnen Sie die PushDeer-App, gehen Sie zum Geräte-Tab, klicken Sie auf das Plus (+) in der oberen rechten Ecke und erlauben Sie das Senden von Benachrichtigungen.\nGehen Sie zum Schlüssel-Tab in PushDeer, kopieren Sie Ihren Schlüssel und fügen Sie ihn in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nTelegram Bot Offizielle API-Konfiguration Offizielle Dokumentation: Telegram Bot API\nDie folgenden Schritte können sich jederzeit ändern. Bitte beziehen Sie sich auf die offizielle Telegram-Dokumentation für die neuesten Anweisungen.\nErstellen eines Bots Verwenden Sie Ihr Telegram-Konto, um den Befehl /start an @BotFather zu senden. Senden Sie dann den Befehl /newbot und folgen Sie den Anweisungen, um einen Namen und einen Benutzernamen für Ihren Bot festzulegen. Sie erhalten detaillierte Informationen über Ihren Bot, einschließlich eines Links zu Ihrem Bot (beginnend mit t.me/) und eines Tokens (beginnend mit Zahlen: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Plugin-Einstellungen Senden Sie den Befehl /start an Ihren neu erstellten Bot in Telegram. Kopieren Sie das von BotFather bereitgestellte Token und fügen Sie es in das Token-Feld in den DutyPusher-Einstellungen ein. Klicken Sie auf Chat-ID erhalten und warten Sie, bis die Chat-ID automatisch ausgefüllt wird. Sobald die Chat-ID abgerufen wurde, klicken Sie auf Test, um zu bestätigen, dass Sie eine Nachricht von Ihrem Bot in Telegram erhalten können. Wenn alles funktioniert, klicken Sie auf Speichern, um es zu verwenden. Tip\nWenn das Plugin Ihre Chat-ID nicht automatisch abrufen kann, versuchen Sie die folgenden Schritte:\nStellen Sie sicher, dass das Token korrekt eingegeben wurde. Senden Sie eine beliebige Nachricht an Ihren Bot und versuchen Sie, die Chat-ID erneut abzurufen. Wenn die obigen Schritte nicht funktionieren:\nÖffnen Sie Ihren Browser und besuchen Sie die folgende URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Hinweis: Ersetzen Sie $YOUR_BOT_TOKEN_HERE mit Ihrem Bot-Token. Suchen Sie das Feld message -\u003e chat -\u003e id in der JSON-Antwort und kopieren Sie es in das Chat-ID-Feld in den Plugin-Einstellungen. "},"title":"Einstellungsanleitung"},"/FFXIVDutyPusher/de/faq/":{"data":{"":" F: Warum erhalte ich keine Push-Benachrichtigungen?\nA: Bitte überprüfen Sie, ob der Push-Kanal korrekt konfiguriert ist, und stellen Sie sicher, dass Ihr Gerät Benachrichtigungen zulässt.\nF: Wie deinstalliere ich das Plugin?\nA: Suchen Sie DutyPusher im Plugin-Center, deaktivieren Sie es und klicken Sie dann auf die Schaltfläche Löschen.\nF: Können Sie Unterstützung für [XX] Push-Kanal hinzufügen?\nA: Bitte reichen Sie ein Issue in diesem Repository mit dem Namen/der Plattform des Push-Kanals ein, und wir werden versuchen, es dem Plugin hinzuzufügen."},"title":"FAQ"},"/FFXIVDutyPusher/docs/":{"data":{"":"","plugin-settings#Plugin Settings":"You can open the DutyPusher settings page in one of the following ways:\nClick the DutyPusher settings button in the Plugin Center. Enter the /dutypusher command in the game. First, select the push channel you want to use from the dropdown menu.\nThen, fill in the required Token/URL/Key for the selected push channel, enable the plugin, and save the settings to start using it.\nAfter configuring the push channel, you can check the activation status of DutyPusher in the DTR Bar at the top-right corner of the game’s main interface. Click the status icon to toggle it on or off.","push-channel-configuration#Push Channel Configuration":"Currently, DutyPusher supports the following push channels: Bark, PushDeer, and Telegram Bot Official API.\nIf you would like to add support for a new platform, please submit an Issue to this repository.\nRepo Links: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nIf you encounter any issues while using this plugin, please do not send feedback to any push channel/platform.\nDo not share your channel URL/Key with anyone!\nBark Configuration Search for Bark in the App Store and install it.\nOpen the Bark app, click Register Device, and allow it to send notifications.\nCopy the first URL in Bark and paste it into the Channel URL/Key field in the DutyPusher settings. Click Save to start using it.\nOptional Configurations\nYou can enable Time Sensitive Notifications in the plugin settings to receive push notifications even when your device is in Focus Mode. In Bark, click View All Sounds and import this Duty Sound. Make sure to rename the file to ff14.caf before importing it. PushDeer Configuration iOS/iPadOS (14+)\nUse your system camera to scan the App Clip Code below to start using PushDeer.\nAlternatively, search for PushDeer in the App Store and install it.\nOpen the PushDeer app, go to the Devices tab, click the plus (+) button in the top-right corner, and allow it to send notifications.\nGo to the Key tab in PushDeer, copy your key, and paste it into the Channel URL/Key field in the DutyPusher settings. Click Save to start using it.\nTelegram Bot Official API Configuration Official Documentation: Telegram Bot API\nThe following steps may change at any time. Please refer to the official Telegram documentation for the latest instructions.\nCreating a Bot Use your Telegram account to send the /start command to @BotFather. Then send the /newbot command and follow the instructions to set a name and username for your bot. You will receive detailed information about your bot, including a link to your bot (starting with t.me/) and a token (starting with numbers: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Plugin Settings Send the /start command to your newly created bot in Telegram. Copy the token provided by BotFather and paste it into the Token field in the DutyPusher settings. Click Get Chat ID and wait for the Chat ID to be automatically filled. Once the Chat ID is retrieved, click Test to confirm that you can receive a message from your bot in Telegram. If everything works, click Save to start using it. Tip\nIf the plugin cannot automatically retrieve your Chat ID, try the following steps:\nEnsure the token is entered correctly. Send any message to your bot and try retrieving the Chat ID again. If the above steps do not work:\nOpen your browser and visit the following URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Note: Replace $YOUR_BOT_TOKEN_HERE with your bot token. Locate the message -\u003e chat -\u003e id field in the JSON response and copy it into the Chat ID field in the plugin settings. "},"title":"Setting Guide"},"/FFXIVDutyPusher/es/":{"data":{"":"","aviso#Aviso":"Para garantizar la seguridad de tu cuenta, evita usar enlaces de repositorios y plugins de fuentes no confiables.\nEl uso de cualquier plugin de terceros puede resultar en la suspensión de tu cuenta. Ten esto en cuenta antes de usar el plugin.\nNo compartas tu archivo de configuración del plugin con nadie. Eres el único responsable de cualquier pérdida causada por esto.\nSi encuentras algún problema al usar este plugin, no envíes comentarios a Dalamud.\nDescargas en Dalamud: ","qué-es-dutypusher#¿Qué es DutyPusher?":"Este es un plugin de Final Fantasy XIV para Dalamud.\nCuando habilitas este plugin y configuras un canal de notificaciones, enviará una notificación a tu dispositivo cuando una cola de mazmorra esté lista en el juego."},"title":"DutyPusher"},"/FFXIVDutyPusher/es/about/":{"data":{"":"","acerca-de-dutypusher#Acerca de DutyPusher":"DutyPusher es un complemento de código abierto para Dalamud desarrollado por MorCherlf para Final Fantasy XIV (FFXIV). Su objetivo es ayudar a los jugadores a relajarse lejos de sus computadoras mientras esperan en la cola para mazmorras. Al utilizar múltiples canales de notificación extensibles, los jugadores pueden recibir alertas inmediatas cuando su cola esté lista, asegurándose de no perderse ninguna mazmorra.\nCaracterísticas principales\nSoporte para múltiples canales de notificación: Actualmente admite las API oficiales de Bark, PushDeer y Telegram Bot, con planes de expandirse a más canales en el futuro. Notificaciones instantáneas: Cuando tu cola para mazmorra esté lista, DutyPusher enviará una notificación inmediata a tu dispositivo. Fácil de usar: Una configuración sencilla te permite empezar a usarlo de inmediato. Opciones personalizables: Admite sonidos de notificación personalizados y notificaciones instantáneas (Bark). Totalmente de código abierto: DutyPusher es completamente de código abierto. Puedes crear tu propia bifurcación o enviarnos un Pull Request. Lo más seguro posible: DutyPusher no interactúa con el servidor del juego ni modifica/opera el juego de ninguna manera directa. Excepto al enviar notificaciones, lo que requiere solicitudes de red a los servidores de los canales de notificación correspondientes, no recopila, registra ni almacena ninguna información. ","acerca-del-desarrollador#Acerca del desarrollador":"Hola, soy MorCherlf. Soy programador, jugador, entusiasta de la música, Furry y más…\nEste es mi primer complemento para Dalamud. Si tienes alguna sugerencia o pregunta, no dudes en enviar un Issue o un Pull Request en GitHub.\nSi tienes alguna pregunta, también puedes contactarme por correo electrónico.","aviso-de-derechos-de-autor-y-descargo-de-responsabilidad#Aviso de derechos de autor y descargo de responsabilidad":"Aviso de derechos de autor Licencia de código abierto Este complemento es de código abierto bajo la licencia AGPL-3.0. Eres libre de usar, modificar y distribuir este complemento, siempre que cumplas con los términos de la licencia AGPL-3.0.\nGeneración del sitio web y tema Este sitio web se genera con Hugo, y el tema está basado en hextra.\nCanales de notificación Los canales de notificación utilizados por este complemento son proporcionados por sus respectivas plataformas/proveedores de servicios, incluyendo, entre otros, Bark, PushDeer y Telegram Bot. Estas plataformas/proveedores de servicios conservan los derechos de propiedad intelectual y las responsabilidades de sus servicios.\nMarca registrada FINAL FANTASY FINAL FANTASY es una marca registrada de Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Todos los derechos reservados. No estamos afiliados a SQUARE ENIX CO., LTD.\nDescargo de responsabilidad Riesgos del uso del complemento Al usar este complemento, reconoces y aceptas los Términos de Servicio de Final Fantasy XIV (FFXIV). Ten en cuenta que, técnicamente, este complemento podría violar los Términos de Servicio de FFXIV, aunque no realizamos operaciones automatizadas ni modificaciones al juego. Aceptas todos los riesgos asociados con el uso de este complemento, incluyendo, entre otros, la suspensión de la cuenta, la pérdida de datos u otras consecuencias.\nLimitación de responsabilidad Los desarrolladores y colaboradores de este complemento no son responsables de ningún daño directo o indirecto derivado del uso de este complemento, incluyendo, entre otros, la suspensión de la cuenta, la pérdida de datos, daños al dispositivo u otras responsabilidades legales o financieras.\nUso bajo tu propia responsabilidad Al usar este complemento, reconoces y aceptas los riesgos mencionados anteriormente y aceptas asumir todas las posibles consecuencias. Recomendamos usar el complemento con precaución y adherirse a los Términos de Servicio de FFXIV."},"title":"Acerca de"},"/FFXIVDutyPusher/es/docs/":{"data":{"":"","plugin-einstellungen#Plugin-Einstellungen":"Sie können die DutyPusher-Einstellungsseite auf eine der folgenden Arten öffnen:\nKlicken Sie auf die DutyPusher-Einstellungsschaltfläche im Plugin-Center. Geben Sie den Befehl /dutypusher im Spiel ein. Wählen Sie zunächst den Push-Kanal aus, den Sie verwenden möchten, aus dem Dropdown-Menü.\nFüllen Sie dann das erforderliche Token/URL/Schlüssel für den ausgewählten Push-Kanal aus, aktivieren Sie das Plugin und speichern Sie die Einstellungen, um es zu verwenden.\nNach der Konfiguration des Push-Kanals können Sie den Aktivierungsstatus von DutyPusher in der DTR-Leiste in der oberen rechten Ecke der Hauptoberfläche des Spiels überprüfen. Klicken Sie auf das Status-Symbol, um es ein- oder auszuschalten.","push-kanal-konfiguration#Push-Kanal-Konfiguration":"Derzeit unterstützt DutyPusher die folgenden Push-Kanäle: Bark, PushDeer und Telegram Bot Offizielle API.\nWenn Sie Unterstützung für eine neue Plattform hinzufügen möchten, reichen Sie bitte ein Issue in diesem Repository ein.\nRepo-Links: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nWenn Sie beim Verwenden dieses Plugins auf Probleme stoßen, senden Sie bitte kein Feedback an einen Push-Kanal/Plattform.\nTeilen Sie Ihre Kanal-URL/Schlüssel nicht mit anderen!\nBark-Konfiguration Suchen Sie im App Store nach Bark und installieren Sie es.\nÖffnen Sie die Bark-App, klicken Sie auf Gerät registrieren und erlauben Sie das Senden von Benachrichtigungen.\nKopieren Sie die erste URL in Bark und fügen Sie sie in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nOptionale Konfigurationen\nSie können Zeitkritische Benachrichtigungen in den Plugin-Einstellungen aktivieren, um Push-Benachrichtigungen zu erhalten, auch wenn Ihr Gerät im Fokusmodus ist. Klicken Sie in Bark auf Alle Sounds anzeigen und importieren Sie diesen Duty-Sound. Stellen Sie sicher, dass die Datei in ff14.caf umbenannt wird, bevor Sie sie importieren. PushDeer-Konfiguration iOS/iPadOS (14+)\nVerwenden Sie Ihre Systemkamera, um den App-Clip-Code unten zu scannen, um PushDeer zu verwenden.\nAlternativ können Sie im App Store nach PushDeer suchen und es installieren.\nÖffnen Sie die PushDeer-App, gehen Sie zum Geräte-Tab, klicken Sie auf das Plus (+) in der oberen rechten Ecke und erlauben Sie das Senden von Benachrichtigungen.\nGehen Sie zum Schlüssel-Tab in PushDeer, kopieren Sie Ihren Schlüssel und fügen Sie ihn in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nTelegram Bot Offizielle API-Konfiguration Offizielle Dokumentation: Telegram Bot API\nDie folgenden Schritte können sich jederzeit ändern. Bitte beziehen Sie sich auf die offizielle Telegram-Dokumentation für die neuesten Anweisungen.\nErstellen eines Bots Verwenden Sie Ihr Telegram-Konto, um den Befehl /start an @BotFather zu senden. Senden Sie dann den Befehl /newbot und folgen Sie den Anweisungen, um einen Namen und einen Benutzernamen für Ihren Bot festzulegen. Sie erhalten detaillierte Informationen über Ihren Bot, einschließlich eines Links zu Ihrem Bot (beginnend mit t.me/) und eines Tokens (beginnend mit Zahlen: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Plugin-Einstellungen Senden Sie den Befehl /start an Ihren neu erstellten Bot in Telegram. Kopieren Sie das von BotFather bereitgestellte Token und fügen Sie es in das Token-Feld in den DutyPusher-Einstellungen ein. Klicken Sie auf Chat-ID erhalten und warten Sie, bis die Chat-ID automatisch ausgefüllt wird. Sobald die Chat-ID abgerufen wurde, klicken Sie auf Test, um zu bestätigen, dass Sie eine Nachricht von Ihrem Bot in Telegram erhalten können. Wenn alles funktioniert, klicken Sie auf Speichern, um es zu verwenden. Tip\nWenn das Plugin Ihre Chat-ID nicht automatisch abrufen kann, versuchen Sie die folgenden Schritte:\nStellen Sie sicher, dass das Token korrekt eingegeben wurde. Senden Sie eine beliebige Nachricht an Ihren Bot und versuchen Sie, die Chat-ID erneut abzurufen. Wenn die obigen Schritte nicht funktionieren:\nÖffnen Sie Ihren Browser und besuchen Sie die folgende URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Hinweis: Ersetzen Sie $YOUR_BOT_TOKEN_HERE mit Ihrem Bot-Token. Suchen Sie das Feld message -\u003e chat -\u003e id in der JSON-Antwort und kopieren Sie es in das Chat-ID-Feld in den Plugin-Einstellungen. "},"title":"Einstellungsanleitung"},"/FFXIVDutyPusher/es/faq/":{"data":{"":" P: ¿Por qué no estoy recibiendo notificaciones push?\nR: Por favor, verifica si el canal de notificaciones está configurado correctamente y asegúrate de que tu dispositivo permita notificaciones.\nP: ¿Cómo desinstalo el plugin?\nR: Busca DutyPusher en el Centro de Plugins, desactívalo y luego haz clic en el botón Eliminar.\nP: ¿Pueden agregar soporte para el canal de notificaciones [XX]?\nR: Por favor, envía un Issue a este repositorio con el nombre del canal de notificaciones o plataforma, y trataremos de agregarlo al plugin."},"title":"Preguntas Frecuentes (FAQ)"},"/FFXIVDutyPusher/faq/":{"data":{"":" Q: Why am I not receiving push notifications?\nA: Please check if the push channel is configured correctly and ensure that your device allows notifications.\nQ: How do I uninstall the plugin?\nA: Find DutyPusher in the Plugin Center, disable it, and then click the Delete button.\nQ: Can you add support for [XX] push channel?\nA: Please submit an Issue to this repository with the push channel name/platform, and we will try to add it to the plugin."},"title":"FAQ"},"/FFXIVDutyPusher/fr/":{"data":{"":"","avertissement#Avertissement":"Pour assurer la sécurité de votre compte, veuillez éviter d’utiliser des liens de dépôt et des plugins provenant de sources non fiables.\nL’utilisation de tout plugin tiers peut entraîner le bannissement de votre compte. Veuillez en être conscient avant d’utiliser le plugin.\nNe partagez pas votre fichier de configuration du plugin avec qui que ce soit. Vous êtes seul responsable des pertes causées par cela.\nSi vous rencontrez des problèmes lors de l’utilisation de ce plugin, veuillez ne pas envoyer de commentaires à Dalamud.\nNombre de téléchargements dans Dalamud : ","quest-ce-que-dutypusher-#Qu\u0026rsquo;est-ce que DutyPusher ?":"\nQu’est-ce que DutyPusher ? Il s’agit d’un plugin Final Fantasy XIV pour Dalamud.\nLorsque vous activez ce plugin et configurez un canal de notification, il enverra une notification à votre appareil lorsqu’une file d’attente de donjon est prête dans le jeu."},"title":"DutyPusher"},"/FFXIVDutyPusher/fr/about/":{"data":{"":"","avis-de-droits-dauteur-et-clause-de-non-responsabilité#Avis de droits d\u0026rsquo;auteur et clause de non-responsabilité":"À propos de DutyPusher DutyPusher est un plugin open source pour Dalamud développé par MorCherlf pour Final Fantasy XIV (FFXIV). Il vise à aider les joueurs à se détendre loin de leurs ordinateurs tout en attendant dans la file d’attente pour les donjons. En utilisant plusieurs canaux de notification extensibles, les joueurs peuvent recevoir des alertes immédiates lorsque leur file d’attente est prête, assurant ainsi qu’ils ne manquent aucun donjon.\nFonctionnalités principales\nPrise en charge de plusieurs canaux de notification : Actuellement, il prend en charge les API officielles de Bark, PushDeer et Telegram Bot, avec des plans pour étendre à d’autres canaux de notification à l’avenir. Notifications instantanées : Lorsque votre file d’attente pour un donjon est prête, DutyPusher enverra immédiatement une notification à votre appareil. Facile à utiliser : Une configuration simple vous permet de commencer à l’utiliser tout de suite. Options personnalisables : Prend en charge les sons de notification personnalisés et les notifications instantanées (Bark). Entièrement open source : DutyPusher est entièrement open source. Vous pouvez créer votre propre fork ou nous soumettre une Pull Request. Aussi sûr que possible : DutyPusher n’interagit pas avec le serveur de jeu ni ne modifie/opère le jeu de quelque manière que ce soit. Sauf pour l’envoi de notifications, qui nécessite des requêtes réseau vers les serveurs des canaux de notification respectifs, il ne collecte, n’enregistre ni ne stocke aucune information. À propos du développeur Bonjour, je suis MorCherlf. Je suis programmeur, joueur, passionné de musique, Furry et plus encore…\nCeci est mon premier plugin pour Dalamud. Si vous avez des suggestions ou des questions, n’hésitez pas à soumettre un Issue ou une Pull Request sur GitHub.\nSi vous avez des questions, vous pouvez également me contacter par email.\nAvis de droits d’auteur et clause de non-responsabilité Avis de droits d’auteur Licence open source Ce plugin est open source sous la licence AGPL-3.0. Vous êtes libre d’utiliser, de modifier et de distribuer ce plugin, à condition de respecter les termes de la licence AGPL-3.0.\nGénération du site web et thème Ce site web est généré avec Hugo, et le thème est basé sur hextra.\nCanaux de notification Les canaux de notification utilisés par ce plugin sont fournis par leurs plateformes/fournisseurs de services respectifs, y compris, mais sans s’y limiter, Bark, PushDeer et Telegram Bot. Ces plateformes/fournisseurs de services conservent les droits de propriété intellectuelle et les responsabilités de leurs services.\nMarque déposée FINAL FANTASY FINAL FANTASY est une marque déposée de Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Tous droits réservés. Nous ne sommes pas affiliés à SQUARE ENIX CO., LTD.\nClause de non-responsabilité Risques liés à l’utilisation du plugin En utilisant ce plugin, vous reconnaissez et acceptez les Conditions d’utilisation de Final Fantasy XIV (FFXIV). Veuillez noter que, techniquement, ce plugin pourrait violer les Conditions d’utilisation de FFXIV, même si nous n’effectuons aucune opération automatisée ou modification du jeu. Vous assumez tous les risques associés à l’utilisation de ce plugin, y compris, mais sans s’y limiter, la suspension de compte, la perte de données ou d’autres conséquences.\nLimitation de responsabilité Les développeurs et contributeurs de ce plugin ne sont pas responsables des dommages directs ou indirects résultant de l’utilisation de ce plugin, y compris, mais sans s’y limiter, la suspension de compte, la perte de données, les dommages matériels ou d’autres responsabilités légales ou financières.\nUtilisation à vos propres risques En utilisant ce plugin, vous reconnaissez et acceptez les risques mentionnés ci-dessus et acceptez d’assumer toutes les conséquences possibles. Nous recommandons d’utiliser le plugin avec prudence et de respecter les Conditions d’utilisation de FFXIV.","à-propos-de-dutypusher#À propos de DutyPusher":"","à-propos-du-développeur#À propos du développeur":""},"title":"À propos"},"/FFXIVDutyPusher/fr/docs/":{"data":{"":"","configuration-des-canaux-de-notification#Configuration des Canaux de Notification":"Actuellement, DutyPusher prend en charge les canaux de notification suivants : Bark, PushDeer et API Officielle Telegram Bot.\nSi vous souhaitez ajouter le support d’une nouvelle plateforme, veuillez soumettre un Issue à ce dépôt.\nLiens des dépôts : Bark | PushDeer\nBot Telegram : API Telegram Bot\nSi vous rencontrez des problèmes lors de l’utilisation de ce plugin, veuillez ne pas envoyer de commentaires à aucun canal de notification ou plateforme.\nNe partagez pas votre URL/Clé de canal avec qui que ce soit !\nConfiguration de Bark Recherchez Bark dans l’App Store et installez-le.\nOuvrez l’application Bark, cliquez sur Enregistrer l’appareil et autorisez-la à envoyer des notifications.\nCopiez la première URL dans Bark et collez-la dans le champ URL/Clé du canal dans les paramètres de DutyPusher. Cliquez sur Enregistrer pour commencer à l’utiliser.\nConfigurations Optionnelles\nVous pouvez activer Notifications Urgentes dans les paramètres du plugin pour recevoir des notifications push même lorsque votre appareil est en mode Focus. Dans Bark, cliquez sur Voir tous les sons et importez ce Son de Duty. Assurez-vous de renommer le fichier en ff14.caf avant de l’importer. Configuration de PushDeer iOS/iPadOS (14+)\nUtilisez l’appareil photo de votre système pour scanner le code App Clip ci-dessous et commencer à utiliser PushDeer.\nAlternativement, recherchez PushDeer dans l’App Store et installez-le.\nOuvrez l’application PushDeer, allez dans l’onglet Appareils, cliquez sur le bouton plus (+) en haut à droite et autorisez-la à envoyer des notifications.\nAllez dans l’onglet Clé dans PushDeer, copiez votre clé et collez-la dans le champ URL/Clé du canal dans les paramètres de DutyPusher. Cliquez sur Enregistrer pour commencer à l’utiliser.\nConfiguration de l’API Officielle Telegram Bot Documentation Officielle : API Telegram Bot\nLes étapes suivantes peuvent changer à tout moment. Veuillez vous référer à la documentation officielle de Telegram pour les instructions les plus récentes.\nCréation d’un Bot Utilisez votre compte Telegram pour envoyer la commande /start à @BotFather. Ensuite, envoyez la commande /newbot et suivez les instructions pour définir un nom et un nom d’utilisateur pour votre bot. Vous recevrez des informations détaillées sur votre bot, y compris un lien vers votre bot (commençant par t.me/) et un token (commençant par des chiffres : 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Paramètres du Plugin Envoyez la commande /start à votre bot nouvellement créé dans Telegram. Copiez le token fourni par BotFather et collez-le dans le champ Token dans les paramètres de DutyPusher. Cliquez sur Obtenir l’ID de chat et attendez que l’ID de chat soit automatiquement rempli. Une fois l’ID de chat récupéré, cliquez sur Tester pour confirmer que vous pouvez recevoir un message de votre bot dans Telegram. Si tout fonctionne, cliquez sur Enregistrer pour commencer à l’utiliser. Tip\nSi le plugin ne parvient pas à récupérer automatiquement votre ID de chat, essayez les étapes suivantes :\nAssurez-vous que le token est correctement entré. Envoyez un message à votre bot et essayez de récupérer à nouveau l’ID de chat. Si les étapes ci-dessus ne fonctionnent pas :\nOuvrez votre navigateur et visitez l’URL suivante : https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Remarque : Remplacez $YOUR_BOT_TOKEN_HERE par votre token de bot. Localisez le champ message -\u003e chat -\u003e id dans la réponse JSON et copiez-le dans le champ ID de chat dans les paramètres du plugin. ","paramètres-du-plugin#Paramètres du Plugin":"Vous pouvez ouvrir la page des paramètres de DutyPusher de l’une des manières suivantes :\nCliquez sur le bouton des paramètres de DutyPusher dans le Centre de Plugins. Entrez la commande /dutypusher dans le jeu. Tout d’abord, sélectionnez le canal de notification que vous souhaitez utiliser dans le menu déroulant.\nEnsuite, remplissez le Token/URL/Clé requis pour le canal de notification sélectionné, activez le plugin et enregistrez les paramètres pour commencer à l’utiliser.\nAprès avoir configuré le canal de notification, vous pouvez vérifier l’état d’activation de DutyPusher dans la Barre DTR en haut à droite de l’interface principale du jeu. Cliquez sur l’icône d’état pour l’activer ou le désactiver."},"title":"Guide de Configuration"},"/FFXIVDutyPusher/fr/faq/":{"data":{"":" Q : Pourquoi je ne reçois pas de notifications push ?\nR : Veuillez vérifier si le canal de notification est correctement configuré et assurez-vous que votre appareil autorise les notifications.\nQ : Comment désinstaller le plugin ?\nR : Trouvez DutyPusher dans le Centre de Plugins, désactivez-le, puis cliquez sur le bouton Supprimer.\nQ : Pouvez-vous ajouter le support pour le canal de notification [XX] ?\nR : Veuillez soumettre un Issue à ce dépôt avec le nom de la plateforme/canal de notification, et nous essaierons de l’ajouter au plugin."},"title":"FAQ"},"/FFXIVDutyPusher/it/":{"data":{"":"","avviso#Avviso":"Per garantire la sicurezza del tuo account, evita di utilizzare link di repository e plugin da fonti non attendibili.\nL’uso di qualsiasi plugin di terze parti potrebbe comportare il ban del tuo account. Ti preghiamo di esserne consapevole prima di utilizzare il plugin.\nNon condividere il file di configurazione del plugin con nessuno. Sei l’unico responsabile di eventuali perdite causate da ciò.\nSe riscontri problemi durante l’uso di questo plugin, non inviare feedback a Dalamud.\nConteggio dei download in Dalamud: ","cosè-dutypusher#Cos\u0026rsquo;è DutyPusher?":"\nCos’è DutyPusher? Questo è un plugin Final Fantasy XIV per Dalamud.\nQuando attivi questo plugin e configuri un canale di notifica, invierà una notifica al tuo dispositivo quando una coda per un dungeon è pronta nel gioco."},"title":"DutyPusher"},"/FFXIVDutyPusher/it/about/":{"data":{"":"","diritti-dautore-e-dichiarazione-di-non-responsabilità#Diritti d\u0026rsquo;autore e dichiarazione di non responsabilità":"Informazioni su DutyPusher DutyPusher è un plugin open source per Dalamud sviluppato da MorCherlf per Final Fantasy XIV (FFXIV). Il suo obiettivo è aiutare i giocatori a rilassarsi lontano dai propri computer mentre aspettano in coda per i dungeon. Utilizzando più canali di notifica estensibili, i giocatori possono ricevere avvisi immediati quando la loro coda è pronta, assicurandosi di non perdere nessun dungeon.\nCaratteristiche principali\nSupporto per più canali di notifica: Attualmente supporta le API ufficiali di Bark, PushDeer e Telegram Bot, con piani per espandersi a più canali di notifica in futuro. Notifiche istantanee: Quando la tua coda per il dungeon è pronta, DutyPusher invierà immediatamente una notifica al tuo dispositivo. Facile da usare: Una configurazione semplice ti permette di iniziare a usarlo subito. Opzioni personalizzabili: Supporta suoni di notifica personalizzati e notifiche istantanee (Bark). Completamente open source: DutyPusher è completamente open source. Puoi creare il tuo fork o inviarci una Pull Request. Il più sicuro possibile: DutyPusher non interagisce con il server di gioco né modifica/opera il gioco in alcun modo. Tranne per l’invio di notifiche, che richiede richieste di rete ai server dei rispettivi canali di notifica, non raccoglie, registra o memorizza alcuna informazione. Informazioni sullo sviluppatore Ciao, sono MorCherlf. Sono un programmatore, giocatore, appassionato di musica, Furry e altro ancora…\nQuesto è il mio primo plugin per Dalamud. Se hai suggerimenti o domande, sentiti libero di inviare un Issue o una Pull Request su GitHub.\nSe hai domande, puoi anche contattarmi via email.\nDiritti d’autore e dichiarazione di non responsabilità Avviso sui diritti d’autore Licenza open source Questo plugin è open source sotto la licenza AGPL-3.0. Sei libero di usare, modificare e distribuire questo plugin, a patto di rispettare i termini della licenza AGPL-3.0.\nGenerazione del sito web e tema Questo sito web è generato con Hugo, e il tema è basato su hextra.\nCanali di notifica I canali di notifica utilizzati da questo plugin sono forniti dalle rispettive piattaforme/fornitori di servizi, tra cui, ma non limitati a, Bark, PushDeer e Telegram Bot. Queste piattaforme/fornitori di servizi conservano i diritti di proprietà intellettuale e le responsabilità dei loro servizi.\nMarchio FINAL FANTASY FINAL FANTASY è un marchio registrato di Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Tutti i diritti riservati. Non siamo affiliati con SQUARE ENIX CO., LTD.\nDichiarazione di non responsabilità Rischi legati all’uso del plugin Utilizzando questo plugin, riconosci e accetti i Termini di Servizio di Final Fantasy XIV (FFXIV). Tieni presente che, tecnicamente, questo plugin potrebbe violare i Termini di Servizio di FFXIV, anche se non eseguiamo operazioni automatizzate o modifiche al gioco. Accetti tutti i rischi associati all’uso di questo plugin, inclusi, ma non limitati a, la sospensione dell’account, la perdita di dati o altre conseguenze.\nLimitazione di responsabilità Gli sviluppatori e i collaboratori di questo plugin non sono responsabili per eventuali danni diretti o indiretti derivanti dall’uso di questo plugin, inclusi, ma non limitati a, la sospensione dell’account, la perdita di dati, danni al dispositivo o altre responsabilità legali o finanziarie.\nUtilizzo a proprio rischio Utilizzando questo plugin, riconosci e accetti i rischi menzionati sopra e accetti di assumerti tutte le possibili conseguenze. Ti raccomandiamo di usare il plugin con cautela e di rispettare i Termini di Servizio di FFXIV.\nFammi sapere se hai bisogno di ulteriori modifiche!","informazioni-su-dutypusher#Informazioni su DutyPusher":"","informazioni-sullo-sviluppatore#Informazioni sullo sviluppatore":""},"title":"Informazioni"},"/FFXIVDutyPusher/it/docs/":{"data":{"":"","configurazione-dei-canali-di-notifica#Configurazione dei Canali di Notifica":"Attualmente, DutyPusher supporta i seguenti canali di notifica: Bark, PushDeer e API Ufficiale Telegram Bot.\nSe desideri aggiungere il supporto per una nuova piattaforma, invia un Issue a questo repository.\nLink ai repository: Bark | PushDeer\nTelegram Bot: API Telegram Bot\nSe riscontri problemi durante l’uso di questo plugin, non inviare feedback a nessun canale di notifica/piattaforma.\nNon condividere il tuo URL/Chiave del canale con nessuno!\nConfigurazione di Bark Cerca Bark nell’App Store e installalo.\nApri l’app Bark, clicca su Registra Dispositivo e consenti l’invio di notifiche.\nCopia il primo URL in Bark e incollalo nel campo URL/Chiave del canale nelle impostazioni di DutyPusher. Clicca su Salva per iniziare a utilizzarlo.\nConfigurazioni Opzionali\nPuoi abilitare Notifiche Tempodipendenti nelle impostazioni del plugin per ricevere notifiche push anche quando il dispositivo è in Modalità Focus. In Bark, clicca su Visualizza Tutti i Suoni e importa questo Suono del Dungeon. Assicurati di rinominare il file in ff14.caf prima di importarlo. Configurazione di PushDeer iOS/iPadOS (14+)\nUsa la fotocamera del tuo sistema per scansionare il codice App Clip qui sotto per iniziare a utilizzare PushDeer.\nIn alternativa, cerca PushDeer nell’App Store e installalo.\nApri l’app PushDeer, vai alla scheda Dispositivi, clicca sul pulsante più (+) in alto a destra e consenti l’invio di notifiche.\nVai alla scheda Chiave in PushDeer, copia la tua chiave e incollala nel campo URL/Chiave del canale nelle impostazioni di DutyPusher. Clicca su Salva per iniziare a utilizzarlo.\nConfigurazione dell’API Ufficiale Telegram Bot Documentazione Ufficiale: API Telegram Bot\nI seguenti passaggi potrebbero cambiare in qualsiasi momento. Fai riferimento alla documentazione ufficiale di Telegram per le istruzioni più recenti.\nCreazione di un Bot Usa il tuo account Telegram per inviare il comando `/start** a @BotFather. Invia poi il comando `/newbot** e segui le istruzioni per impostare un nome e un username per il tuo bot. Riceverai informazioni dettagliate sul tuo bot, inclusi un link al tuo bot (che inizia con t.me/) e un token (che inizia con numeri: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Impostazioni del Plugin Invia il comando `/start** al tuo bot appena creato su Telegram. Copia il token fornito da BotFather e incollalo nel campo Token nelle impostazioni di DutyPusher. Clicca su Ottieni Chat ID e attendi che il Chat ID venga compilato automaticamente. Una volta ottenuto il Chat ID, clicca su Test per confermare che puoi ricevere un messaggio dal tuo bot su Telegram. Se tutto funziona, clicca su Salva per iniziare a utilizzarlo. Tip\nSe il plugin non riesce a recuperare automaticamente il tuo Chat ID, prova i seguenti passaggi:\nAssicurati che il token sia inserito correttamente. Invia un messaggio qualsiasi al tuo bot e prova a recuperare nuovamente il Chat ID. Se i passaggi sopra non funzionano:\nApri il tuo browser e visita il seguente URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Nota: Sostituisci $YOUR_BOT_TOKEN_HERE con il token del tuo bot. Trova il campo message -\u003e chat -\u003e id nella risposta JSON e copialo nel campo Chat ID nelle impostazioni del plugin. ","impostazioni-del-plugin#Impostazioni del Plugin":"Puoi aprire la pagina delle impostazioni di DutyPusher in uno dei seguenti modi:\nClicca sul pulsante delle impostazioni di DutyPusher nel Centro Plugin. Inserisci il comando /dutypusher nel gioco. Per prima cosa, seleziona il canale di notifica che desideri utilizzare dal menu a tendina.\nSuccessivamente, inserisci il Token/URL/Chiave richiesto per il canale di notifica selezionato, abilita il plugin e salva le impostazioni per iniziare a utilizzarlo.\nDopo aver configurato il canale di notifica, puoi verificare lo stato di attivazione di DutyPusher nella Barra DTR nell’angolo superiore destro dell’interfaccia principale del gioco. Clicca sull’icona dello stato per attivarlo o disattivarlo."},"title":"Guida alle Impostazioni"},"/FFXIVDutyPusher/it/faq/":{"data":{"":" D: Perché non ricevo notifiche push?\nR: Controlla se il canale di notifica è configurato correttamente e assicurati che il tuo dispositivo consenta le notifiche.\nD: Come posso disinstallare il plugin?\nR: Trova DutyPusher nel Centro Plugin, disabilitalo e poi clicca sul pulsante Elimina.\nD: Puoi aggiungere il supporto per il canale di notifica [XX]?\nR: Invia un Issue a questo repository con il nome del canale di notifica/piattaforma, e cercheremo di aggiungerlo al plugin."},"title":"FAQ"},"/FFXIVDutyPusher/ja/":{"data":{"":"","dutypusherとは#DutyPusherとは？":"これはFinal Fantasy XIVのDalamudプラグインです。\nこのプラグインを有効にし、プッシュチャネルを設定すると、ゲーム内でダンジョンの準備が整った際にデバイスに通知を送信します。","注意事項#注意事項":"アカウントの安全性を確保するため、信頼できないソースからのリポジトリリンクやプラグインの使用は避けてください。\nサードパーティ製プラグインの使用はアカウントのBANにつながる可能性があります。使用前に十分ご注意ください。\nプラグインの設定ファイルを他人と共有しないでください。これによる損失はすべて自己責任となります。\nこのプラグインの使用中に問題が発生した場合、Dalamudにフィードバックを送信しないでください。\nDalamudでのダウンロード数: "},"title":"DutyPusher"},"/FFXIVDutyPusher/ja/about/":{"data":{"":"","dutypusherについて#DutyPusherについて":"DutyPusherは、MorCherlfによって開発されたFinal Fantasy XIV（FFXIV）向けのオープンソースのDalamudプラグインです。このプラグインは、ダンジョンの待機中にプレイヤーがコンピューターから離れてリラックスできるよう支援することを目的としています。複数の拡張可能なプッシュ通知チャネルを利用することで、プレイヤーは待機が完了した際に即座に通知を受け取り、ダンジョンを見逃すことがないようにします。\n主な機能\n複数のプッシュ通知チャネルをサポート：現在、Bark、PushDeer、Telegram Botの公式APIをサポートしており、将来的にはさらに多くのプッシュ通知チャネルに対応する予定です。 即時通知：ダンジョンの待機が完了すると、DutyPusherはすぐにデバイスに通知を送信します。 使いやすい：簡単な設定で、すぐに使い始めることができます。 カスタマイズ可能なオプション：カスタム通知音や即時通知（Bark）をサポートしています。 完全なオープンソース：DutyPusherは完全にオープンソースです。独自のフォークを作成したり、Pull Requestを送信したりすることができます。 可能な限り安全：DutyPusherはゲームサーバーとやり取りせず、ゲームを直接変更/操作しません。通知を送信するためにそれぞれのプッシュ通知チャネルサーバーへのネットワークリクエストが必要な場合を除き、情報を収集、記録、保存することはありません。 ","著作権と免責事項#著作権と免責事項":"著作権について オープンソースライセンス このプラグインは、AGPL-3.0ライセンスの下でオープンソースとして提供されています。AGPL-3.0ライセンスの条件に従う限り、このプラグインを自由に使用、変更、配布することができます。\nウェブサイトの生成とテーマ このウェブサイトはHugoで生成されており、テーマはhextraをベースにしています。\nプッシュ通知チャネル このプラグインで使用されるプッシュ通知チャネルは、Bark、PushDeer、Telegram Botなどの各プラットフォーム/サービスプロバイダーによって提供されています。これらのプラットフォーム/サービスプロバイダーは、それぞれのサービスに対する独立した知的財産権と責任を保持しています。\nFINAL FANTASYの商標 FINAL FANTASYはSquare Enix Holdings Co., Ltd.の登録商標です。FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. All rights reserved. 私たちはSQUARE ENIX CO., LTD.とは提携していません。\n免責事項 プラグイン使用のリスク このプラグインを使用する際は、Final Fantasy XIV（FFXIV）の利用規約に同意したものとみなされます。 技術的には、このプラグインはFFXIVの利用規約に違反する可能性があることにご注意ください。私たちはゲームに対する自動操作や変更を行いませんが、それでもリスクが存在します。 このプラグインの使用に伴うすべてのリスク（アカウント停止、データ損失、その他の結果を含むがこれに限らない）を自己責任で負うことになります。\n責任の制限 このプラグインの開発者および貢献者は、このプラグインの使用に起因する直接的または間接的な損害（ゲームアカウントの停止、データ損失、デバイスの損傷、その他の法的または金銭的責任を含むがこれに限らない）について一切の責任を負いません。\n自己責任での使用 このプラグインを使用する際は、上記のリスクを認識し、すべての可能な結果を自己責任で負うことに同意したものとみなされます。プラグインを慎重に使用し、FFXIVの利用規約を遵守することをお勧めします。","開発者について#開発者について":"こんにちは、私はMorCherlfです。プログラマー、ゲーマー、音楽愛好家、Furryなど、多様な側面を持っています…\nこれは私にとって初めてのDalamudプラグインです。ご提案や質問があれば、GitHubでIssueやPull Requestを送信してください。\n質問がある場合は、メールでもご連絡いただけます。"},"title":"について"},"/FFXIVDutyPusher/ja/docs/":{"data":{"":"","プッシュチャネル設定#プッシュチャネル設定":"現在、DutyPusherは以下のプッシュチャネルをサポートしています: Bark、PushDeer、Telegram Bot公式API。\n新しいプラットフォームのサポートを追加したい場合は、このリポジトリにIssueを提出してください。\nリポジトリリンク: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nこのプラグインの使用中に問題が発生した場合、プッシュチャネル/プラットフォームにフィードバックを送信しないでください。\nチャネルURL/Keyを他人と共有しないでください！\nBark設定 App StoreでBarkを検索してインストールしてください。\nBarkアプリを開き、Register Deviceをクリックして通知の送信を許可します。\nBarkの最初のURLをコピーし、DutyPusher設定のChannel URL/Key欄に貼り付けて、Saveをクリックすると使用を開始できます。\nオプション設定\nプラグイン設定でTime Sensitive Notificationsを有効にすると、デバイスがフォーカスモード中でもプッシュ通知を受信できます。 BarkでView All Soundsをクリックし、このダンジョン音をインポートしてください。インポート前にファイル名をff14.cafに変更してください。 PushDeer設定 iOS/iPadOS (14+)\nシステムカメラで以下のApp ClipコードをスキャンしてPushDeerを使用開始できます。\nまたは、App StoreでPushDeerを検索してインストールしてください。\nPushDeerアプリを開き、Devicesタブで右上のプラス（+）ボタンをクリックして通知の送信を許可します。\nPushDeerのKeyタブでキーをコピーし、DutyPusher設定のChannel URL/Key欄に貼り付けて、Saveをクリックすると使用を開始できます。\nTelegram Bot公式API設定 公式ドキュメント: Telegram Bot API\n以下の手順は変更される可能性があります。最新の手順についてはTelegramの公式ドキュメントを参照してください。\nBotの作成 Telegramアカウントで@BotFatherに/startコマンドを送信します。 次に/newbotコマンドを送信し、指示に従ってBotの名前とユーザー名を設定します。 Botの詳細情報が送信されます。これにはBotへのリンク（t.me/で始まる）とトークン（数字で始まる: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx）が含まれます。 プラグイン設定 Telegramで新しく作成したBotに/startコマンドを送信します。 BotFatherから提供されたトークンをコピーし、DutyPusher設定のToken欄に貼り付けます。Get Chat IDをクリックし、Chat IDが自動的に入力されるのを待ちます。 Chat IDが取得されたら、TestをクリックしてTelegramでBotからのメッセージを受信できるか確認します。すべて正常に動作する場合、Saveをクリックして使用を開始できます。 Tip\nプラグインが自動的にChat IDを取得できない場合、以下の手順を試してください:\nトークンが正しく入力されていることを確認します。 Botに任意のメッセージを送信し、再度Chat IDを取得してみます。 上記の手順でも解決しない場合:\nブラウザで以下のURLにアクセスします: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates 注: $YOUR_BOT_TOKEN_HEREをBotのトークンに置き換えてください。 JSONレスポンス内のmessage -\u003e chat -\u003e idフィールドを見つけ、プラグイン設定のChat ID欄にコピーします。 ","プラグイン設定#プラグイン設定":"DutyPusherの設定ページは以下の方法で開くことができます:\nプラグインセンターでDutyPusherの設定ボタンをクリックする。 ゲーム内で/dutypusherコマンドを入力する。 まず、ドロップダウンメニューから使用したいプッシュチャネルを選択してください。\n次に、選択したプッシュチャネルに必要なToken/URL/Keyを入力し、プラグインを有効にして設定を保存すると使用を開始できます。\nプッシュチャネルの設定が完了したら、ゲームのメインインターフェースの右上にあるDTR BarでDutyPusherの有効状態を確認できます。ステータスアイコンをクリックして有効/無効を切り替えてください。"},"title":"設定ガイド"},"/FFXIVDutyPusher/ja/faq/":{"data":{"":" Q: プッシュ通知が届かないのはなぜですか？\nA: プッシュチャネルが正しく設定されているか確認し、デバイスが通知を許可しているか確認してください。\nQ: プラグインをアンインストールするにはどうすればいいですか？\nA: プラグインセンターでDutyPusherを見つけ、無効にしてから削除ボタンをクリックしてください。\nQ: ○○プッシュチャネルのサポートを追加できますか？\nA: プッシュチャネル名/プラットフォームを記載して、このリポジトリにIssueを提出してください。プラグインに追加できるよう検討します。"},"title":"よくある質問"},"/FFXIVDutyPusher/ko/":{"data":{"":"","dutypusher란#DutyPusher란?":"이것은 파이널 판타지 XIV Dalamud 플러그인입니다.\n이 플러그인을 활성화하고 푸시 채널을 구성하면, 게임 내 던전 대기열이 준비되었을 때 기기에 알림을 보냅니다.","주의사항#주의사항":"계정의 안전을 위해 신뢰할 수 없는 소스의 저장소 링크와 플러그인 사용을 피하십시오.\n모든 서드파티 플러그인 사용은 계정 정지로 이어질 수 있습니다. 플러그인 사용 전 이를 인지하십시오.\n플러그인 설정 파일을 다른 사람과 공유하지 마십시오. 이로 인한 모든 손실은 본인에게 책임이 있습니다.\n이 플러그인 사용 중 문제가 발생하면 Dalamud에 피드백을 보내지 마십시오.\nDalamud 다운로드 횟수: "},"title":"DutyPusher"},"/FFXIVDutyPusher/ko/about/":{"data":{"":"","dutypusher-소개#DutyPusher 소개":"DutyPusher는 Final Fantasy XIV(FFXIV)를 위한 MorCherlf가 개발한 오픈소스 Dalamud 플러그인입니다. 이 플러그인은 던전 대기 중에 플레이어가 컴퓨터에서 떨어져 편안하게 시간을 보낼 수 있도록 돕는 것을 목표로 합니다. 여러 확장 가능한 푸시 알림 채널을 활용하여, 플레이어는 대기가 완료되었을 때 즉각적으로 알림을 받아 던전을 놓치지 않을 수 있습니다.\n주요 기능\n다중 푸시 알림 채널 지원: 현재 Bark, PushDeer, Telegram Bot 공식 API를 지원하며, 향후 더 많은 푸시 알림 채널을 추가할 계획입니다. 즉각적인 알림: 던전 대기가 완료되면 DutyPusher가 즉시 디바이스로 알림을 보냅니다. 사용이 간편: 간단한 설정으로 바로 사용할 수 있습니다. 커스터마이징 가능한 옵션: 커스텀 알림음 및 즉각적인 알림(Bark)을 지원합니다. 완전한 오픈소스: DutyPusher는 완전히 오픈소스입니다. 자신만의 포크를 만들거나 Pull Request를 제출할 수 있습니다. 최대한 안전: DutyPusher는 게임 서버와 상호작용하지 않으며, 게임을 직접 수정하거나 조작하지 않습니다. 알림을 보내기 위해 각 푸시 알림 채널 서버에 네트워크 요청을 보내는 것 외에는 어떠한 정보도 수집, 기록, 저장하지 않습니다. ","개발자-소개#개발자 소개":"안녕하세요, 저는 MorCherlf입니다. 저는 프로그래머, 게이머, 음악 애호가, 퍼리 등 다양한 관심사를 가지고 있습니다…\n이것은 제가 처음으로 개발한 Dalamud 플러그인입니다. 제안이나 질문이 있다면 GitHub에 Issue나 Pull Request를 제출해 주세요.\n궁금한 점이 있다면 이메일로도 연락할 수 있습니다.","저작권-및-면책-조항#저작권 및 면책 조항":"저작권 공지 오픈소스 라이선스 이 플러그인은 AGPL-3.0 라이선스 하에 오픈소스로 제공됩니다. AGPL-3.0 라이선스의 조건을 준수하는 한, 이 플러그인을 자유롭게 사용, 수정, 배포할 수 있습니다.\n웹사이트 생성 및 테마 이 웹사이트는 Hugo로 생성되었으며, 테마는 hextra를 기반으로 합니다.\n푸시 알림 채널 이 플러그인에서 사용하는 푸시 알림 채널은 Bark, PushDeer, Telegram Bot 등 각 플랫폼/서비스 제공자에 의해 제공됩니다. 이러한 플랫폼/서비스 제공자는 각자의 서비스에 대한 독립적인 지적 재산권과 책임을 보유합니다.\nFINAL FANTASY 상표 FINAL FANTASY는 Square Enix Holdings Co., Ltd.의 등록 상표입니다. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. All rights reserved. 저희는 SQUARE ENIX CO., LTD.와 제휴 관계가 없습니다.\n면책 조항 플러그인 사용의 위험성 이 플러그인을 사용함으로써, Final Fantasy XIV(FFXIV)의 이용 약관에 동의한 것으로 간주됩니다. 기술적으로 이 플러그인은 FFXIV의 이용 약관을 위반할 가능성이 있으므로 주의가 필요합니다. 저희는 게임에 대한 자동화된 조작이나 수정을 수행하지 않지만, 여전히 위험이 존재할 수 있습니다. 이 플러그인 사용과 관련된 모든 위험(계정 정지, 데이터 손실, 기타 결과 포함)은 사용자 본인의 책임 하에 있습니다.\n책임의 제한 이 플러그인의 개발자 및 기여자는 이 플러그인 사용으로 인해 발생하는 직접적 또는 간접적 손해(게임 계정 정지, 데이터 손실, 기기 손상, 기타 법적 또는 재정적 책임 포함)에 대해 어떠한 책임도 지지 않습니다.\n자기 책임 하에 사용 이 플러그인을 사용함으로써, 위에서 언급한 위험을 인지하고 모든 가능한 결과를 자기 책임 하에 감수하는 데 동의한 것으로 간주됩니다. 플러그인을 신중하게 사용하고 FFXIV의 이용 약관을 준수할 것을 권장합니다."},"title":"소개"},"/FFXIVDutyPusher/ko/docs/":{"data":{"":"","푸시-채널-구성#푸시 채널 구성":"현재 DutyPusher는 다음 푸시 채널을 지원합니다: Bark, PushDeer, Telegram Bot Official API.\n새로운 플랫폼 지원을 추가하고 싶다면, 이 저장소에 Issue를 제출해 주세요.\n저장소 링크: Bark | PushDeer\nTelegram Bot: Telegram Bot API\n이 플러그인 사용 중 문제가 발생하면 어떤 푸시 채널/플랫폼에도 피드백을 보내지 마십시오.\n채널 URL/Key를 다른 사람과 공유하지 마십시오!\nBark 구성 App Store에서 Bark를 검색하여 설치합니다.\nBark 앱을 열고, Register Device를 클릭한 후 알림 전송을 허용합니다.\nBark에서 첫 번째 URL을 복사하여 DutyPusher 설정의 Channel URL/Key 필드에 붙여넣습니다. 저장을 클릭하여 사용을 시작합니다.\n선택적 구성\n플러그인 설정에서 시간 민감 알림을 활성화하여 기기가 Focus 모드일 때도 푸시 알림을 받을 수 있습니다. Bark에서 View All Sounds를 클릭하고 이 Duty 사운드를 가져옵니다. 파일을 ff14.caf로 이름을 변경한 후 가져오는 것을 확인하세요. PushDeer 구성 iOS/iPadOS (14+)\n시스템 카메라를 사용하여 아래 App Clip 코드를 스캔하여 PushDeer 사용을 시작합니다.\n또는 App Store에서 PushDeer를 검색하여 설치합니다.\nPushDeer 앱을 열고, Devices 탭으로 이동한 후 오른쪽 상단의 더하기 (+) 버튼을 클릭하여 알림 전송을 허용합니다.\nPushDeer에서 Key 탭으로 이동하여 키를 복사하고, DutyPusher 설정의 Channel URL/Key 필드에 붙여넣습니다. 저장을 클릭하여 사용을 시작합니다.\nTelegram Bot Official API 구성 공식 문서: Telegram Bot API\n다음 단계는 언제든지 변경될 수 있습니다. 최신 지침은 공식 Telegram 문서를 참조하십시오.\n봇 생성 Telegram 계정을 사용하여 @BotFather에게 /start 명령어를 보냅니다. 그런 다음 /newbot 명령어를 보내고 지시에 따라 봇의 이름과 사용자 이름을 설정합니다. 봇에 대한 상세 정보를 받게 되며, 이는 봇 링크(t.me/로 시작)와 토큰(숫자로 시작: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx)을 포함합니다. 플러그인 설정 Telegram에서 새로 생성한 봇에게 /start 명령어를 보냅니다. BotFather가 제공한 토큰을 복사하여 DutyPusher 설정의 Token 필드에 붙여넣습니다. Get Chat ID를 클릭하고 Chat ID가 자동으로 채워질 때까지 기다립니다. Chat ID가 검색되면, Test를 클릭하여 Telegram에서 봇으로부터 메시지를 받을 수 있는지 확인합니다. 모든 것이 작동하면 저장을 클릭하여 사용을 시작합니다. Tip\n플러그인이 Chat ID를 자동으로 검색할 수 없는 경우, 다음 단계를 시도해 보십시오:\n토큰이 올바르게 입력되었는지 확인합니다. 봇에게 아무 메시지나 보내고 Chat ID를 다시 검색해 보십시오. 위의 단계가 작동하지 않는 경우:\n브라우저를 열고 다음 URL을 방문합니다: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates 참고: $YOUR_BOT_TOKEN_HERE를 봇 토큰으로 대체합니다. JSON 응답에서 message -\u003e chat -\u003e id 필드를 찾아 플러그인 설정의 Chat ID 필드에 복사합니다. ","플러그인-설정#플러그인 설정":"DutyPusher 설정 페이지는 다음 방법 중 하나로 열 수 있습니다:\n플러그인 센터에서 DutyPusher 설정 버튼을 클릭합니다. 게임 내에서 /dutypusher 명령어를 입력합니다. 먼저, 드롭다운 메뉴에서 사용할 푸시 채널을 선택합니다.\n그런 다음, 선택한 푸시 채널에 필요한 Token/URL/Key를 입력하고, 플러그인을 활성화한 후 설정을 저장하여 사용을 시작합니다.\n푸시 채널을 구성한 후, 게임 메인 인터페이스의 오른쪽 상단에 있는 DTR Bar에서 DutyPusher의 활성화 상태를 확인할 수 있습니다. 상태 아이콘을 클릭하여 활성화 또는 비활성화를 전환할 수 있습니다."},"title":"설정 가이드"},"/FFXIVDutyPusher/ko/faq/":{"data":{"":" Q: 푸시 알림을 받지 못하는 이유는 무엇인가요?\nA: 푸시 채널이 올바르게 구성되었는지 확인하고, 기기에서 알림을 허용했는지 확인하세요.\nQ: 플러그인을 어떻게 삭제하나요?\nA: 플러그인 센터에서 DutyPusher를 찾아 비활성화한 후, 삭제 버튼을 클릭하세요.\nQ: [XX] 푸시 채널을 지원할 수 있나요?\nA: 이 저장소에 Issue를 제출하고 푸시 채널 이름/플랫폼을 알려주시면, 플러그인에 추가하도록 노력하겠습니다."},"title":"자주 묻는 질문"},"/FFXIVDutyPusher/nor/":{"data":{"":"","hva-er-dutypusher#Hva er DutyPusher?":"Dette er en Final Fantasy XIV Dalamud-pluggin.\nNår du aktiverer denne plugginen og konfigurerer en push-kanal, vil den sende et varsel til enheten din når en dungeon-kø er klar i spillet.","merknad#Merknad":"For å sikre sikkerheten til kontoen din, vennligst unngå å bruke repository-lenker og pluggins fra upålitelige kilder.\nBruk av tredjeparts-pluggins kan føre til at kontoen din blir utestengt. Vær oppmerksom på dette før du bruker plugginen.\nDel ikke konfigurasjonsfilen for plugginen med noen. Du er alene ansvarlig for eventuelle tap forårsaket av dette.\nHvis du opplever problemer mens du bruker denne plugginen, vennligst ikke send tilbakemelding til Dalamud.\nNedlastingsantall i Dalamud: "},"title":"DutyPusher"},"/FFXIVDutyPusher/nor/about/":{"data":{"":"","om-dutypusher#Om DutyPusher":"DutyPusher er en open-source Dalamud-plug-in utviklet av MorCherlf for Final Fantasy XIV (FFXIV). Den har som mål å hjelpe spillere å slappe av bort fra datamaskinen mens de venter i kø til dungeons. Ved å bruke flere utvidbare push-kanaler kan spillere motta umiddelbare varsler når køen deres er klar, noe som sikrer at de ikke går glipp av en dungeon.\nNøkkelfunksjoner\nStøtte for flere push-kanaler: Støtter for øyeblikket Bark, PushDeer og Telegram Bot offisielle API-er, med planer om å utvide til flere push-kanaler i fremtiden. Umiddelbare varsler: Når dungeon-køen din er klar, sender DutyPusher umiddelbart et varsel til enheten din. Enkel å bruke: Enkel oppsett gjør det mulig å begynne å bruke den med en gang. Tilpassbare alternativer: Støtter egendefinerte varsellyder og umiddelbare varsler (Bark). Fullstendig open-source: DutyPusher er fullstendig open-source. Du kan lage din egen forgrening eller sende en Pull Request til oss. Så sikker som mulig: DutyPusher samhandler ikke med spillserveren eller endrer/opererer spillet direkte på noen måte. Bortsett fra å sende varsler, som krever nettverksforespørsler til de respektive push-kanalserverne, samler den ikke inn, registrerer eller lagrer noen informasjon. ","om-utvikleren#Om utvikleren":"Hei, jeg er MorCherlf. Jeg er en programmerer, gamer, musikkentusiast, Furry og mer…\nDette er min første Dalamud-plug-in. Hvis du har noen forslag eller spørsmål, kan du gjerne sende en Issue eller Pull Request på GitHub.\nHvis du har noen spørsmål, kan du også nå meg via e-post.","opphavsrett-og-ansvarsfraskrivelse#Opphavsrett og ansvarsfraskrivelse":"Opphavsrettsmerknad Open-source-lisens Denne plug-inen er open-source under AGPL-3.0-lisensen. Du har frihet til å bruke, endre og distribuere denne plug-inen, forutsatt at du overholder vilkårene i AGPL-3.0-lisensen.\nGenerering av nettsted og tema Dette nettstedet er generert av Hugo, og temaet er basert på hextra.\nPush-kanaler Push-kanalene som brukes av denne plug-inen, leveres av sine respektive plattformer/tjenesteleverandører, inkludert, men ikke begrenset til, Bark, PushDeer og Telegram Bot. Disse plattformene/tjenesteleverandørene beholder uavhengige intellektuelle eiendomsrettigheter og ansvar for sine tjenester.\nFINAL FANTASY-varemerke FINAL FANTASY er et registrert varemerke for Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Alle rettigheter forbeholdt. Vi er ikke tilknyttet SQUARE ENIX CO., LTD.\nAnsvarsfraskrivelse Risiko ved bruk av plug-in Ved å bruke denne plug-inen erkjenner og godtar du bruksvilkårene for Final Fantasy XIV (FFXIV). Vær oppmerksom på at denne plug-inen teknisk sett kan bryte FFXIVs bruksvilkår, selv om vi ikke utfører noen automatiserte operasjoner eller endringer i spillet. Du påtar deg alle risikoer knyttet til bruken av denne plug-inen, inkludert, men ikke begrenset til, kontostans, datatap eller andre konsekvenser.\nBegrensning av ansvar Utviklere og bidragsytere til denne plug-inen er ikke ansvarlige for noen direkte eller indirekte skader som oppstår fra bruken av denne plug-inen, inkludert, men ikke begrenset til, kontostans, datatap, skade på enheter eller andre juridiske eller økonomiske forpliktelser.\nBruk på eget ansvar Ved å bruke denne plug-inen erkjenner og godtar du risikoene nevnt ovenfor og samtykker i å bære alle mulige konsekvenser. Vi anbefaler å bruke plug-inen med forsiktighet og overholde FFXIVs bruksvilkår."},"title":"Om"},"/FFXIVDutyPusher/nor/docs/":{"data":{"":"","pluggin-innstillinger#Pluggin-innstillinger":"Du kan åpne innstillingssiden for DutyPusher på en av følgende måter:\nKlikk på DutyPusher-innstillingsknappen i Plugin-senteret. Skriv inn kommandoen /dutypusher i spillet. Først, velg push-kanalen du ønsker å bruke fra rullegardinmenyen.\nDeretter, fyll ut den nødvendige Token/URL/Nøkkel for den valgte push-kanalen, aktiver plugginen, og lagre innstillingene for å begynne å bruke den.\nEtter at du har konfigurert push-kanalen, kan du sjekke aktivitetsstatusen til DutyPusher i DTR Bar øverst til høyre i spillets hovedgrensesnitt. Klikk på statusikonet for å slå den av eller på.","push-kanal-konfigurasjon#Push-kanal konfigurasjon":"For øyeblikket støtter DutyPusher følgende push-kanaler: Bark, PushDeer, og Telegram Bot Offisiell API.\nHvis du ønsker å legge til støtte for en ny plattform, vennligst send inn en Issue til dette repositoryet.\nRepo-lenker: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nHvis du opplever problemer mens du bruker denne plugginen, vennligst ikke send tilbakemelding til noen push-kanal/plattform.\nDel ikke kanal-URL/Nøkkel med noen!\nBark konfigurasjon Søk etter Bark i App Store og installer den.\nÅpne Bark-appen, klikk på Registrer enhet, og tillat den å sende varsler.\nKopier den første URL-en i Bark og lim den inn i Kanal-URL/Nøkkel-feltet i DutyPusher-innstillingene. Klikk på Lagre for å begynne å bruke den.\nValgfrie konfigurasjoner\nDu kan aktivere Tidsfølsomme varsler i pluggin-innstillingene for å motta push-varsler selv når enheten din er i Fokus-modus. I Bark, klikk på Vis alle lyder og importer denne Duty-lyden. Sørg for å omdøpe filen til ff14.caf før du importerer den. PushDeer konfigurasjon iOS/iPadOS (14+)\nBruk systemkameraet ditt til å skanne App Clip-koden under for å begynne å bruke PushDeer.\nAlternativt, søk etter PushDeer i App Store og installer den.\nÅpne PushDeer-appen, gå til Enheter-fanen, klikk på pluss (+) -knappen øverst til høyre, og tillat den å sende varsler.\nGå til Nøkkel-fanen i PushDeer, kopier nøkkelen din, og lim den inn i Kanal-URL/Nøkkel-feltet i DutyPusher-innstillingene. Klikk på Lagre for å begynne å bruke den.\nTelegram Bot Offisiell API konfigurasjon Offisiell dokumentasjon: Telegram Bot API\nFølgende trinn kan endres når som helst. Vennligst se den offisielle Telegram-dokumentasjonen for de siste instruksjonene.\nOpprette en bot Bruk Telegram-kontoen din til å sende /start-kommandoen til @BotFather. Send deretter /newbot-kommandoen og følg instruksjonene for å sette et navn og brukernavn for boten din. Du vil motta detaljert informasjon om boten din, inkludert en lenke til boten din (starter med t.me/) og en token (starter med tall: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Pluggin-innstillinger Send /start-kommandoen til den nylig opprettede boten din i Telegram. Kopier tokenen som ble gitt av BotFather og lim den inn i Token-feltet i DutyPusher-innstillingene. Klikk på Hent Chat ID og vent til Chat ID-en automatisk fylles ut. Når Chat ID-en er hentet, klikk på Test for å bekrefte at du kan motta en melding fra boten din i Telegram. Hvis alt fungerer, klikk på Lagre for å begynne å bruke den. Tip\nHvis plugginen ikke automatisk kan hente Chat ID-en din, prøv følgende trinn:\nSørg for at tokenen er skrevet inn riktig. Send en hvilken som helst melding til boten din og prøv å hente Chat ID-en på nytt. Hvis trinnene ovenfor ikke fungerer:\nÅpne nettleseren din og besøk følgende URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Merk: Erstatt $YOUR_BOT_TOKEN_HERE med bot-tokenen din. Finn message -\u003e chat -\u003e id-feltet i JSON-svaret og kopier det inn i Chat ID-feltet i pluggin-innstillingene. "},"title":"Installasjonsveiledning"},"/FFXIVDutyPusher/nor/faq/":{"data":{"":" Q: Hvorfor mottar jeg ikke push-varsler?\nA: Vennligst sjekk om push-kanalen er konfigurert riktig og forsikre deg om at enheten din tillater varsler.\nQ: Hvordan avinstallerer jeg plugginen?\nA: Finn DutyPusher i Plugin-senteret, deaktiver den, og klikk deretter på Slett-knappen.\nQ: Kan du legge til støtte for [XX] push-kanal?\nA: Vennligst send inn en Issue til dette repositoryet med navnet på push-kanalen/plattformen, så vil vi prøve å legge den til i plugginen."},"title":"FAQ"},"/FFXIVDutyPusher/ru/":{"data":{"":"","важное-предупреждение#Важное предупреждение":"Для обеспечения безопасности вашего аккаунта, пожалуйста, избегайте использования ссылок на репозитории и плагины из ненадежных источников.\nИспользование любых сторонних плагинов может привести к блокировке вашего аккаунта. Пожалуйста, учитывайте это перед использованием плагина.\nНе делитесь файлом конфигурации плагина с кем-либо. Вы несете полную ответственность за любые потери, вызванные этим.\nЕсли вы столкнулись с проблемами при использовании этого плагина, пожалуйста, не отправляйте отзывы в Dalamud.\nКоличество загрузок в Dalamud: ","что-такое-dutypusher#Что такое DutyPusher?":"Это плагин для Final Fantasy XIV в рамках Dalamud.\nКогда вы активируете этот плагин и настраиваете канал уведомлений, он будет отправлять уведомление на ваше устройство, когда подземелье будет готово к входу в игре."},"title":"DutyPusher"},"/FFXIVDutyPusher/ru/about/":{"data":{"":"","авторские-права-и-отказ-от-ответственности#Авторские права и отказ от ответственности":"Уведомление об авторских правах Открытая лицензия Этот плагин распространяется под лицензией AGPL-3.0. Вы можете свободно использовать, изменять и распространять этот плагин при условии соблюдения условий лицензии AGPL-3.0.\nГенерация сайта и тема Этот сайт создан с помощью Hugo, а тема основана на hextra.\nКаналы уведомлений Каналы уведомлений, используемые этим плагином, предоставляются соответствующими платформами/провайдерами услуг, включая, но не ограничиваясь, Bark, PushDeer и Telegram Bot. Эти платформы/провайдеры сохраняют независимые права на интеллектуальную собственность и ответственность за свои услуги.\nТоварный знак FINAL FANTASY FINAL FANTASY является зарегистрированным товарным знаком Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Все права защищены. Мы не связаны с SQUARE ENIX CO., LTD.\nОтказ от ответственности Риски использования плагина Используя этот плагин, вы признаете и соглашаетесь с Условиями обслуживания Final Fantasy XIV (FFXIV). Обратите внимание, что технически этот плагин может нарушать Условия обслуживания FFXIV, даже если мы не выполняем никаких автоматизированных операций или изменений в игре. Вы принимаете на себя все риски, связанные с использованием этого плагина, включая, но не ограничиваясь, блокировкой аккаунта, потерей данных или другими последствиями.\nОграничение ответственности Разработчики и участники этого плагина не несут ответственности за любые прямые или косвенные убытки, возникшие в результате использования этого плагина, включая, но не ограничиваясь, блокировкой аккаунта, потерей данных, повреждением устройств или другими юридическими или финансовыми обязательствами.\nИспользование на свой страх и риск Используя этот плагин, вы признаете и принимаете указанные выше риски и соглашаетесь нести все возможные последствия. Мы рекомендуем использовать плагин с осторожностью и соблюдать Условия обслуживания FFXIV.","о-dutypusher#О DutyPusher":"DutyPusher — это открытый плагин для Dalamud, разработанный MorCherlf для Final Fantasy XIV (FFXIV). Он призван помочь игрокам расслабиться вдали от компьютера, ожидая своей очереди на подземелья. Используя несколько расширяемых каналов уведомлений, игроки могут получать мгновенные оповещения, когда их очередь подходит, чтобы не пропустить вход в подземелье.\nОсновные функции\nПоддержка нескольких каналов уведомлений: В настоящее время поддерживаются официальные API Bark, PushDeer и Telegram Bot, с планами расширения на большее количество каналов в будущем. Мгновенные уведомления: Когда ваша очередь на подземелье подходит, DutyPusher сразу же отправляет уведомление на ваше устройство. Простота в использовании: Простая настройка позволяет начать использование сразу же. Настраиваемые опции: Поддерживает пользовательские звуки уведомлений и мгновенные уведомления (Bark). Полностью открытый код: DutyPusher полностью открыт. Вы можете создать свою собственную версию или отправить Pull Request нам. Максимальная безопасность: DutyPusher не взаимодействует с игровым сервером и не изменяет/управляет игрой напрямую. За исключением отправки уведомлений, которые требуют сетевых запросов к серверам соответствующих каналов уведомлений, плагин не собирает, не записывает и не хранит никакой информации. ","о-разработчике#О разработчике":"Привет, я MorCherlf. Я программист, геймер, любитель музыки, фурри и многое другое…\nЭто мой первый плагин для Dalamud. Если у вас есть предложения или вопросы, не стесняйтесь отправить Issue или Pull Request на GitHub.\nЕсли у вас есть вопросы, вы также можете связаться со мной по электронной почте."},"title":"О проекте"},"/FFXIVDutyPusher/ru/docs/":{"data":{"":"","настройка-каналов-уведомлений#Настройка каналов уведомлений":"В настоящее время DutyPusher поддерживает следующие каналы уведомлений: Bark, PushDeer и Официальный API Telegram Bot.\nЕсли вы хотите добавить поддержку новой платформы, пожалуйста, отправьте Issue в этот репозиторий.\nСсылки на репозитории: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nЕсли вы столкнулись с проблемами при использовании этого плагина, пожалуйста, не отправляйте отзывы на любой канал уведомлений/платформу.\nНе делитесь своим URL/Key канала с кем-либо!\nНастройка Bark Найдите Bark в App Store и установите его.\nОткройте приложение Bark, нажмите Register Device и разрешите отправку уведомлений.\nСкопируйте первый URL в Bark и вставьте его в поле Channel URL/Key в настройках DutyPusher. Нажмите Сохранить, чтобы начать использование.\nДополнительные настройки\nВы можете включить Срочные уведомления в настройках плагина, чтобы получать push-уведомления, даже если ваше устройство находится в режиме “Не беспокоить”. В Bark нажмите View All Sounds и импортируйте этот Звук Duty. Убедитесь, что переименовали файл в ff14.caf перед импортом. Настройка PushDeer iOS/iPadOS (14+)\nИспользуйте камеру вашего устройства, чтобы отсканировать App Clip Code ниже, чтобы начать использование PushDeer.\nЛибо найдите PushDeer в App Store и установите его.\nОткройте приложение PushDeer, перейдите на вкладку Devices, нажмите на плюс (+) в верхнем правом углу и разрешите отправку уведомлений.\nПерейдите на вкладку Key в PushDeer, скопируйте ваш ключ и вставьте его в поле Channel URL/Key в настройках DutyPusher. Нажмите Сохранить, чтобы начать использование.\nНастройка Официального API Telegram Bot Официальная документация: Telegram Bot API\nСледующие шаги могут измениться в любое время. Пожалуйста, обратитесь к официальной документации Telegram для получения актуальных инструкций.\nСоздание бота Используйте ваш аккаунт Telegram, чтобы отправить команду /start @BotFather. Затем отправьте команду `/newbot** и следуйте инструкциям, чтобы задать имя и username для вашего бота. Вы получите подробную информацию о вашем боте, включая ссылку на бота (начинающуюся с t.me/) и токен (начинающийся с цифр: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Настройки плагина Отправьте команду /start вашему новому боту в Telegram. Скопируйте токен, предоставленный BotFather, и вставьте его в поле Token в настройках DutyPusher. Нажмите Получить Chat ID и дождитесь автоматического заполнения Chat ID. После получения Chat ID нажмите Тест, чтобы убедиться, что вы можете получить сообщение от вашего бота в Telegram. Если всё работает, нажмите Сохранить, чтобы начать использование. Tip\nЕсли плагин не может автоматически получить ваш Chat ID, попробуйте следующие шаги:\nУбедитесь, что токен введён правильно. Отправьте любое сообщение вашему боту и попробуйте получить Chat ID снова. Если вышеуказанные шаги не работают:\nОткройте ваш браузер и перейдите по следующему URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Примечание: Замените $YOUR_BOT_TOKEN_HERE на ваш токен бота. Найдите поле message -\u003e chat -\u003e id в JSON-ответе и скопируйте его в поле Chat ID в настройках плагина. ","настройки-плагина#Настройки плагина":"Вы можете открыть страницу настроек DutyPusher одним из следующих способов:\nНажмите кнопку настроек DutyPusher в центре плагинов. Введите команду /dutypusher в игре. Сначала выберите канал уведомлений, который вы хотите использовать, из выпадающего меню.\nЗатем заполните необходимый Token/URL/Key для выбранного канала уведомлений, активируйте плагин и сохраните настройки, чтобы начать его использование.\nПосле настройки канала уведомлений вы можете проверить статус активации DutyPusher в DTR Bar в верхнем правом углу основного интерфейса игры. Нажмите на значок статуса, чтобы включить или выключить его."},"title":"Руководство по настройке"},"/FFXIVDutyPusher/ru/faq/":{"data":{"":" Вопрос: Почему я не получаю push-уведомления?\nОтвет: Пожалуйста, проверьте, правильно ли настроен канал уведомлений, и убедитесь, что ваше устройство разрешает получение уведомлений.\nВопрос: Как удалить плагин?\nОтвет: Найдите DutyPusher в центре плагинов, отключите его, а затем нажмите кнопку Удалить.\nВопрос: Можете ли вы добавить поддержку [XX] канала уведомлений?\nОтвет: Пожалуйста, отправьте Issue в этот репозиторий с указанием названия канала уведомлений/платформы, и мы постараемся добавить его в плагин."},"title":"Часто задаваемые вопросы (FAQ)"},"/FFXIVDutyPusher/tw/":{"data":{"":"","注意事項#注意事項":"為了保障您的帳號安全，請避免使用來源不明的倉庫連結及插件。\n任何第三方插件都可能導致您的帳號遭到封禁，請您使用前知悉\n不要將您的插件配置文件發送給任何人，如因此造成的損失，請您自己承擔\n在使用本插件過程中遇到了問題，請不要向Dalamud發送反饋\nDalamud中下載量: ","這是什麼#這是什麼？":"這是一個最終幻想14的Dalamud插件\n當您啟用此插件並配置好推送通道後，遊戲內任務器搜索到任務時，此插件將會通過配置好的推送通道向您的設備發送一則通知"},"title":"DutyPusher"},"/FFXIVDutyPusher/tw/about/":{"data":{"":"","版權與免責聲明#版權與免責聲明":"版權聲明 開源許可證 本插件採用 AGPL-3.0 許可證 開源。你可以自由使用、修改和分發本插件，前提是遵守 AGPL-3.0 許可證的條款。\n網站生成與主題 本網站由 Hugo 生成，主題基於 hextra。\n推送通道 本插件使用的推送通道由各自的平台/服務提供商提供，包括但不限於 Bark、PushDeer 和 Telegram Bot。這些平台/服務提供商保留對其服務的獨立知識產權和責任。\nFINAL FANTASY 商標 FINAL FANTASY 是 Square Enix Holdings Co., Ltd. 的註冊商標。FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. 保留所有權利。 我們與 SQUARE ENIX CO., LTD. 無關。\n免責聲明 插件使用風險 使用本插件即表示你承認並同意 Final Fantasy XIV (FFXIV) 的服務條款。 請注意，從技術上講，本插件可能違反 FFXIV 的服務條款，即使我們沒有執行任何自動化操作或修改遊戲。 你需承擔使用本插件的所有風險，包括但不限於帳號停權、數據丟失或其他後果。\n責任限制 本插件的開發者和貢獻者不對因使用本插件而產生的任何直接或間接損害負責，包括但不限於遊戲帳號停權、數據丟失、設備損壞或其他法律或財務責任。\n自擔風險使用 使用本插件即表示你承認並接受上述風險，並同意承擔所有可能的後果。我們建議謹慎使用插件並遵守 FFXIV 的服務條款。","關於-dutypusher#關於 DutyPusher":"DutyPusher 是一個由 MorCherlf 開發的開源 Dalamud 插件，用於 Final Fantasy XIV (FFXIV)。它的目的是幫助玩家在等待地下城排隊時放鬆遠離電腦。通過利用多個可擴展的推送通道，玩家可以在排隊成功時立即收到通知，確保他們不會錯過地下城。\n主要功能\n支援多種推送通道：目前支援 Bark、PushDeer 和 Telegram Bot 的官方 API，未來計劃擴展到更多推送通道。 即時通知：當你的地下城排隊成功時，DutyPusher 會立即向你的設備發送通知。 易於使用：簡單的設置讓你馬上就能開始使用。 可自定義選項：支援自定義通知聲音和即時通知（Bark）。 完全開源：DutyPusher 是完全開源的。你可以創建自己的分支或向我們提交 Pull Request。 盡可能安全：DutyPusher 不會與遊戲伺服器互動，也不會直接修改/操作遊戲。除了發送通知需要向相應的推送通道伺服器發送網絡請求外，它不會收集、記錄或存儲任何信息。 ","關於開發者#關於開發者":"你好，我是 MorCherlf。我是一名程序員、遊戲玩家、音樂愛好者、Furry 等等…\n這是我第一個 Dalamud 插件。如果你有任何建議或問題，歡迎在 GitHub 上提交 Issue 或 Pull Request。\n如果你有任何問題，也可以通過 電子郵件 聯繫我。"},"title":"關於"},"/FFXIVDutyPusher/tw/docs/":{"data":{"":"","推送通道配置#推送通道配置":"目前狒狒排本小助手支援Bark，PushDeer，和Telegram Bot 官方API推送渠道\n如果想要增加某一平台的推送渠道，可以向此倉庫提交Issue\nRepo 連結： Bark PushDeer\nTelegram Bot：Telegram Bot API\n在使用本插件過程中遇到了問題，請不要向任一推送渠道/平台發送反饋\n請不要把您的渠道URL/Key洩露給任何人！\nBark配置 請在App Store中搜索Bark並安裝\n打開Bark應用後，首先點擊註冊設備，並允許其發送通知。\n將Bark中的第一條連結複製並貼上到DutyPusher插件設定中的渠道URL/Key中，點擊儲存即可開始使用\n可選配置\n您可以在插件設定中勾選上時效通知，這樣即使在您的設備開啟專注模式時仍會收到排本推送 您可以在Bark中點擊查看所有鈴聲，然後導入此排本音效。請確保將鈴聲文件命名為ff14.caf後再導入。 PushDeer配置 iOS/iPadOS (14+)\n請使用系統相機掃描此輕App碼即可開始使用PushDeer\n或在App Store中搜索PushDeer並安裝\n打開PushDeer應用後，首先進入設備選項卡，點擊右上角的加號（+）按鈕，並允許其發送通知。\n點擊PushDeer選項卡Key，將您的Key複製並貼上到插件設定中的渠道URL/Key中，點擊儲存即可開始使用\nTelegram Bot Official API 配置 官方參考說明：Telegram Bot API 文件\n以下步驟可能隨時會更改，請以Telegram 官方說明為準\n創建Bot 使用你的Telegram 帳號向 @BotFather 發送/start指令 然後再向其發送/newbot指令，根據其提示給你的Bot設置名字和username 接下來你將收到關於你的Bot的詳細信息，其中包含一個指向你創建的Bot的連結以t.me/開頭，一串以數字開頭的Token0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx 插件設定 在Telegram中向你剛剛創建的Bot發送/start指令 將BotFather發送的Token複製並貼上到插件設定中的Token中，點擊取得 ChatID後，等待Chat ID 中自動填充你的Chat ID 當自動獲取到Chat ID後，點擊測試，確認是否能在你的Telegram帳號中接收到來自你剛剛創建的Bot的消息，如果一切正常點擊儲存後即可開始使用 Tip\n如果插件無法自動獲取到您的Chat ID，請嘗試以下步驟：\n確認Token填寫正確 向你創建的Bot發送任一消息後，再次嘗試獲取 如果以上步驟均無效：\n打開瀏覽器訪問以下URL： https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates 注意：請將$YOUR_BOT_TOKEN_HERE替換為您的Bot Token。 查看獲取到的JSON文本，定位到message-chat-id，並將其複製到插件設定中的Chat ID中即可 ","插件設定#插件設定":"您可以通過以下兩種方式打開DutyPusher的設定頁面：\n在插件中心點擊DutyPusher的設定按鈕。 在遊戲內輸入/dutypusher指令。 首先，在下拉選單中選擇你想使用的推送渠道\n然後在下方填寫該推送渠道所需的Token/URL/Key等內容，勾選啟用並儲存就可以開始使用了\n配置好推送渠道後，您可以在遊戲主頁面右上方的DTR Bar中查看狒狒排本小助手的啟用狀態。點擊狀態圖標即可切換啟用或禁用狀態。"},"title":"設定指南"},"/FFXIVDutyPusher/tw/faq/":{"data":{"":" Q: 為什麼我收不到推送通知？\nA: 請檢查推送渠道的配置是否正確，並確保您的設備已允許接收通知\nQ: 如何解除安裝插件？\nA: 在插件中心找到DutyPusher，禁用插件後點擊刪除按鈕即可\nQ: 能不能添加xx推送渠道？\nA: 請在此Repo中提交 Issue ，請提供推送渠道名稱/平台，我會嘗試將其添加到插件中"},"title":"常見問題"},"/FFXIVDutyPusher/zh-cn/":{"data":{"":"","注意事项#注意事项":"为了保障您的账号安全，请避免使用来源不明的仓库链接及插件。\n任何第三方插件都可能导致您的账号遭到封禁，请您使用前知悉\n不要将您的插件配置文件发送给任何人，如因此造成的损失，请您自己承担\n在使用本插件过程中遇到了问题，请不要向Dalamud发送反馈\nDalamud中下载量: ","这是什么#这是什么？":"这是一个最终幻想14的Dalamud(卫月)插件\n当您启用此插件并配置好推送通道后，游戏内任务器搜索到任务时，此插件将会通过配置好的推送通道向您的设备发送一则通知"},"title":"狒狒排本小助手"},"/FFXIVDutyPusher/zh-cn/about/":{"data":{"":"","关于开发者#关于开发者":"你好，我是MorCherlf，我是一名程序员/游戏玩家/音乐爱好者/Furry/……\n这是我开发的第一款Dalamud 插件，如果您有任何建议或问题，欢迎在Github上提交Issue或是Pull Request。\n如果您有任何问题，欢迎向我发送邮件","关于狒狒排本小助手#关于狒狒排本小助手":"狒狒排本小助手由MorCherlf开发的一款适用于《最终幻想XIV》FF14 的Dalamud开源插件，旨在帮助玩家在排队等待副本时远离电脑放松一下，通过可扩展的多种推送渠道，让玩家可以在排队成功时立即收到提醒，避免错过副本。\n主要特点\n多推送渠道支持：目前支持Bark、PushDeer和Telegram Bot官方API，未来将持续拓展更多推送渠道。 即时通知：当副本排队成功时，狒狒排本小助手会立即发送通知到您的设备。 简单易用：只需简单设置即可开始使用。 自定义选项：支持自定义通知音效和即时通知（Bark）。 完全开源: 狒狒排本小助手完全开源，你可以创建属于你自己的分支，或向我们提交Pull Request。 尽可能安全：狒狒排本小助手不与游戏服务器进行任何交互，也不直接对游戏进行任何修改/操作，除发送通知时会与对应推送渠道的服务器发送网络请求外，不收集/记录/保存任何信息 ","版权声明与免责声明#版权声明与免责声明":"版权声明 开源协议 本插件基于 AGPL-3.0 License 开源。您可以自由使用、修改和分发本插件，但需遵守 AGPL-3.0 协议的相关规定。 网页生成与主题 本网页生成由 Hugo 提供，页面主题基于 hextra 构建。 推送渠道 本插件使用的推送渠道由各自推送平台/服务商提供，包括但不限于 Bark、PushDeer 和 Telegram Bot。这些平台/服务商对其提供的服务拥有独立的知识产权和责任。 FINAL FANTASY 商标 FINAL FANTASY 是 Square Enix Holdings Co., Ltd. 的注册商标。FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. 保留所有权利。 我们与 SQUARE ENIX CO., LTD. 没有任何关联。 免责声明 插件使用风险 使用此插件默认您了解并同意《最终幻想14》（FFXIV）的服务条款。 请注意，从技术上讲，该插件可能违反了 FFXIV 的服务条款，即使我们没有对游戏进行自动化操作或修改。 您应自行承担使用本插件可能带来的风险，包括但不限于账号封禁、数据丢失或其他后果。 责任限制 本插件的开发者及贡献者不对因使用本插件而产生的任何直接或间接损失负责，包括但不限于游戏账号封禁、数据丢失、设备损坏或其他法律或财务责任。 自行承担风险 使用本插件即表示您已知晓并接受上述风险，并同意自行承担所有可能的后果。我们建议您在使用插件时谨慎行事，并遵守 FFXIV 的服务条款。 "},"title":"关于"},"/FFXIVDutyPusher/zh-cn/docs/":{"data":{"":"","推送通道配置#推送通道配置":"目前狒狒排本小助手支持Bark，PushDeer，和Telegram Bot 官方API推送渠道\n如果想要增加某一平台的推送渠道，可以向此仓库提交Issue\nRepo 链接： Bark PushDeer\nTelegram Bot：Telegram Bot API\n在使用本插件过程中遇到了问题，请不要向任一推送渠道/平台发送反馈\n请不要把您的渠道URL/Key泄露给任何人！\nBark配置 请在App Store中搜索Bark并安装\n打开Bark应用后，首先点击注册设备，并允许其发送通知。\n将Bark中的第一条链接复制并粘贴到DutyPusher插件设置中的渠道URL/Key中，点击保存即可开始使用\n可选配置\n您可以在插件设置中勾选上时效通知，这样即使在您的设备开启专注模式时仍会收到排本推送 您可以在Bark中点击查看所有铃声，然后导入此排本音效。请确保将铃声文件命名为ff14.caf后再导入。 PushDeer配置 iOS/iPadOS (14+)\n请使用系统相机扫描此轻App码即可开始使用PushDeer\n或在App Store中搜索PushDeer并安装\n打开PushDeer应用后，首先进入设备选项卡，点击右上角的加号（+）按钮，并允许其发送通知。\n点击PushDeer选项卡Key，将您的Key复制并粘贴到插件设置中的渠道URL/Key中，点击保存即可开始使用\nTelegram Bot Official API 配置 官方参考说明：Telegram Bot API 文档\n以下步骤可能随时会更改，请以Telegram 官方说明为准\n创建Bot 使用你的Telegram 账号向 @BotFather 发送/start指令 然后再向其发送/newbot指令，根据其提示给你的Bot设置名字和username 接下来你将收到关于你的Bot的详细信息，其中包含一个指向你创建的Bot的链接以t.me/开头，一串以数字开头的Token0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx 插件设置 在Telegram中向你刚刚创建的Bot发送/start指令 将BotFather发送的Token复制并粘贴到插件设置中的Token中，点击获取 ChatID后，等待Chat ID 中自动填充你的Chat ID 当自动获取到Chat ID后，点击测试，确认是否能在你的Telegram账号中接收到来自你刚刚创建的Bot的消息，如果一切正常点击保存后即可开始使用 Tip\n如果插件无法自动获取到您的Chat ID，请尝试以下步骤：\n确认Token填写正确 向你创建的Bot发送任一消息后，再次尝试获取 如果以上步骤均无效：\n打开浏览器访问以下URL： https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates 注意：请将$YOUR_BOT_TOKEN_HERE替换为您的Bot Token。 查看获取到的JSON文本，定位到message-chat-id，并将其复制到插件设置中的Chat ID中即可 ","插件设置#插件设置":"您可以通过以下两种方式打开DutyPusher的设置页面：\n在插件中心点击DutyPusher的设置按钮。 在游戏内输入/dutypusher指令。 首先，在下拉菜单中选择你想使用的推送渠道\n然后在下方填写该推送渠道所需的Token/URL/Key等内容，勾选启用并保存就可以开始使用了\n配置好推送渠道后，您可以在游戏主页面右上方的DTR Bar中查看狒狒排本小助手的启用状态。点击状态图标即可切换启用或禁用状态。"},"title":"设置指南"},"/FFXIVDutyPusher/zh-cn/faq/":{"data":{"":" Q: 为什么我收不到推送通知？\nA: 请检查推送渠道的配置是否正确，并确保您的设备已允许接收通知\nQ: 如何卸载插件？\nA: 在插件中心找到DutyPusher，禁用插件后点击删除按钮即可\nQ: 能不能添加xx推送渠道？\nA: 请在此Repo中提交 Issue ，请提供推送渠道名称/平台，我会尝试将其添加到插件中"},"title":"常见问题"}}