{"/FFXIVDutyPusher/es/about/":{"data":{"":"","acerca-de-dutypusher#Acerca de DutyPusher":"DutyPusher es un complemento de código abierto para Dalamud desarrollado por MorCherlf para Final Fantasy XIV (FFXIV). Su objetivo es ayudar a los jugadores a relajarse lejos de sus computadoras mientras esperan en la cola para mazmorras. Al utilizar múltiples canales de notificación extensibles, los jugadores pueden recibir alertas inmediatas cuando su cola esté lista, asegurándose de no perderse ninguna mazmorra.\nCaracterísticas principales\nSoporte para múltiples canales de notificación: Actualmente admite las API oficiales de Bark, PushDeer y Telegram Bot, con planes de expandirse a más canales en el futuro. Notificaciones instantáneas: Cuando tu cola para mazmorra esté lista, DutyPusher enviará una notificación inmediata a tu dispositivo. Fácil de usar: Una configuración sencilla te permite empezar a usarlo de inmediato. Opciones personalizables: Admite sonidos de notificación personalizados y notificaciones instantáneas (Bark). Totalmente de código abierto: DutyPusher es completamente de código abierto. Puedes crear tu propia bifurcación o enviarnos un Pull Request. Lo más seguro posible: DutyPusher no interactúa con el servidor del juego ni modifica/opera el juego de ninguna manera directa. Excepto al enviar notificaciones, lo que requiere solicitudes de red a los servidores de los canales de notificación correspondientes, no recopila, registra ni almacena ninguna información. ","acerca-del-desarrollador#Acerca del desarrollador":"Hola, soy MorCherlf. Soy programador, jugador, entusiasta de la música, Furry y más…\nEste es mi primer complemento para Dalamud. Si tienes alguna sugerencia o pregunta, no dudes en enviar un Issue o un Pull Request en GitHub.\nSi tienes alguna pregunta, también puedes contactarme por correo electrónico.","aviso-de-derechos-de-autor-y-descargo-de-responsabilidad#Aviso de derechos de autor y descargo de responsabilidad":"Aviso de derechos de autor Licencia de código abierto Este complemento es de código abierto bajo la licencia AGPL-3.0. Eres libre de usar, modificar y distribuir este complemento, siempre que cumplas con los términos de la licencia AGPL-3.0.\nGeneración del sitio web y tema Este sitio web se genera con Hugo, y el tema está basado en hextra.\nCanales de notificación Los canales de notificación utilizados por este complemento son proporcionados por sus respectivas plataformas/proveedores de servicios, incluyendo, entre otros, Bark, PushDeer y Telegram Bot. Estas plataformas/proveedores de servicios conservan los derechos de propiedad intelectual y las responsabilidades de sus servicios.\nMarca registrada FINAL FANTASY FINAL FANTASY es una marca registrada de Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Todos los derechos reservados. No estamos afiliados a SQUARE ENIX CO., LTD.\nDescargo de responsabilidad Riesgos del uso del complemento Al usar este complemento, reconoces y aceptas los Términos de Servicio de Final Fantasy XIV (FFXIV). Ten en cuenta que, técnicamente, este complemento podría violar los Términos de Servicio de FFXIV, aunque no realizamos operaciones automatizadas ni modificaciones al juego. Aceptas todos los riesgos asociados con el uso de este complemento, incluyendo, entre otros, la suspensión de la cuenta, la pérdida de datos u otras consecuencias.\nLimitación de responsabilidad Los desarrolladores y colaboradores de este complemento no son responsables de ningún daño directo o indirecto derivado del uso de este complemento, incluyendo, entre otros, la suspensión de la cuenta, la pérdida de datos, daños al dispositivo u otras responsabilidades legales o financieras.\nUso bajo tu propia responsabilidad Al usar este complemento, reconoces y aceptas los riesgos mencionados anteriormente y aceptas asumir todas las posibles consecuencias. Recomendamos usar el complemento con precaución y adherirse a los Términos de Servicio de FFXIV."},"title":"Acerca de"},"/FFXIVDutyPusher/es/docs/":{"data":{"":"","plugin-einstellungen#Plugin-Einstellungen":"Sie können die DutyPusher-Einstellungsseite auf eine der folgenden Arten öffnen:\nKlicken Sie auf die DutyPusher-Einstellungsschaltfläche im Plugin-Center. Geben Sie den Befehl /dutypusher im Spiel ein. Wählen Sie zunächst den Push-Kanal aus, den Sie verwenden möchten, aus dem Dropdown-Menü.\nFüllen Sie dann das erforderliche Token/URL/Schlüssel für den ausgewählten Push-Kanal aus, aktivieren Sie das Plugin und speichern Sie die Einstellungen, um es zu verwenden.\nNach der Konfiguration des Push-Kanals können Sie den Aktivierungsstatus von DutyPusher in der DTR-Leiste in der oberen rechten Ecke der Hauptoberfläche des Spiels überprüfen. Klicken Sie auf das Status-Symbol, um es ein- oder auszuschalten.","push-kanal-konfiguration#Push-Kanal-Konfiguration":"Derzeit unterstützt DutyPusher die folgenden Push-Kanäle: Bark, PushDeer und Telegram Bot Offizielle API.\nWenn Sie Unterstützung für eine neue Plattform hinzufügen möchten, reichen Sie bitte ein Issue in diesem Repository ein.\nRepo-Links: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nWenn Sie beim Verwenden dieses Plugins auf Probleme stoßen, senden Sie bitte kein Feedback an einen Push-Kanal/Plattform.\nTeilen Sie Ihre Kanal-URL/Schlüssel nicht mit anderen!\nBark-Konfiguration Suchen Sie im App Store nach Bark und installieren Sie es.\nÖffnen Sie die Bark-App, klicken Sie auf Gerät registrieren und erlauben Sie das Senden von Benachrichtigungen.\nKopieren Sie die erste URL in Bark und fügen Sie sie in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nOptionale Konfigurationen\nSie können Zeitkritische Benachrichtigungen in den Plugin-Einstellungen aktivieren, um Push-Benachrichtigungen zu erhalten, auch wenn Ihr Gerät im Fokusmodus ist. Klicken Sie in Bark auf Alle Sounds anzeigen und importieren Sie diesen Duty-Sound. Stellen Sie sicher, dass die Datei in ff14.caf umbenannt wird, bevor Sie sie importieren. PushDeer-Konfiguration iOS/iPadOS (14+)\nVerwenden Sie Ihre Systemkamera, um den App-Clip-Code unten zu scannen, um PushDeer zu verwenden.\nAlternativ können Sie im App Store nach PushDeer suchen und es installieren.\nÖffnen Sie die PushDeer-App, gehen Sie zum Geräte-Tab, klicken Sie auf das Plus (+) in der oberen rechten Ecke und erlauben Sie das Senden von Benachrichtigungen.\nGehen Sie zum Schlüssel-Tab in PushDeer, kopieren Sie Ihren Schlüssel und fügen Sie ihn in das Feld Kanal-URL/Schlüssel in den DutyPusher-Einstellungen ein. Klicken Sie auf Speichern, um es zu verwenden.\nTelegram Bot Offizielle API-Konfiguration Offizielle Dokumentation: Telegram Bot API\nDie folgenden Schritte können sich jederzeit ändern. Bitte beziehen Sie sich auf die offizielle Telegram-Dokumentation für die neuesten Anweisungen.\nErstellen eines Bots Verwenden Sie Ihr Telegram-Konto, um den Befehl /start an @BotFather zu senden. Senden Sie dann den Befehl /newbot und folgen Sie den Anweisungen, um einen Namen und einen Benutzernamen für Ihren Bot festzulegen. Sie erhalten detaillierte Informationen über Ihren Bot, einschließlich eines Links zu Ihrem Bot (beginnend mit t.me/) und eines Tokens (beginnend mit Zahlen: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Plugin-Einstellungen Senden Sie den Befehl /start an Ihren neu erstellten Bot in Telegram. Kopieren Sie das von BotFather bereitgestellte Token und fügen Sie es in das Token-Feld in den DutyPusher-Einstellungen ein. Klicken Sie auf Chat-ID erhalten und warten Sie, bis die Chat-ID automatisch ausgefüllt wird. Sobald die Chat-ID abgerufen wurde, klicken Sie auf Test, um zu bestätigen, dass Sie eine Nachricht von Ihrem Bot in Telegram erhalten können. Wenn alles funktioniert, klicken Sie auf Speichern, um es zu verwenden. Tip\nWenn das Plugin Ihre Chat-ID nicht automatisch abrufen kann, versuchen Sie die folgenden Schritte:\nStellen Sie sicher, dass das Token korrekt eingegeben wurde. Senden Sie eine beliebige Nachricht an Ihren Bot und versuchen Sie, die Chat-ID erneut abzurufen. Wenn die obigen Schritte nicht funktionieren:\nÖffnen Sie Ihren Browser und besuchen Sie die folgende URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Hinweis: Ersetzen Sie $YOUR_BOT_TOKEN_HERE mit Ihrem Bot-Token. Suchen Sie das Feld message -\u003e chat -\u003e id in der JSON-Antwort und kopieren Sie es in das Chat-ID-Feld in den Plugin-Einstellungen. "},"title":"Einstellungsanleitung"},"/FFXIVDutyPusher/es/faq/":{"data":{"":" P: ¿Por qué no estoy recibiendo notificaciones push?\nR: Por favor, verifica si el canal de notificaciones está configurado correctamente y asegúrate de que tu dispositivo permita notificaciones.\nP: ¿Cómo desinstalo el plugin?\nR: Busca DutyPusher en el Centro de Plugins, desactívalo y luego haz clic en el botón Eliminar.\nP: ¿Pueden agregar soporte para el canal de notificaciones [XX]?\nR: Por favor, envía un Issue a este repositorio con el nombre del canal de notificaciones o plataforma, y trataremos de agregarlo al plugin."},"title":"Preguntas Frecuentes (FAQ)"}}