{"/FFXIVDutyPusher/fr/about/":{"data":{"":"","avis-de-droits-dauteur-et-clause-de-non-responsabilité#Avis de droits d\u0026rsquo;auteur et clause de non-responsabilité":"À propos de DutyPusher DutyPusher est un plugin open source pour Dalamud développé par MorCherlf pour Final Fantasy XIV (FFXIV). Il vise à aider les joueurs à se détendre loin de leurs ordinateurs tout en attendant dans la file d’attente pour les donjons. En utilisant plusieurs canaux de notification extensibles, les joueurs peuvent recevoir des alertes immédiates lorsque leur file d’attente est prête, assurant ainsi qu’ils ne manquent aucun donjon.\nFonctionnalités principales\nPrise en charge de plusieurs canaux de notification : Actuellement, il prend en charge les API officielles de Bark, PushDeer et Telegram Bot, avec des plans pour étendre à d’autres canaux de notification à l’avenir. Notifications instantanées : Lorsque votre file d’attente pour un donjon est prête, DutyPusher enverra immédiatement une notification à votre appareil. Facile à utiliser : Une configuration simple vous permet de commencer à l’utiliser tout de suite. Options personnalisables : Prend en charge les sons de notification personnalisés et les notifications instantanées (Bark). Entièrement open source : DutyPusher est entièrement open source. Vous pouvez créer votre propre fork ou nous soumettre une Pull Request. Aussi sûr que possible : DutyPusher n’interagit pas avec le serveur de jeu ni ne modifie/opère le jeu de quelque manière que ce soit. Sauf pour l’envoi de notifications, qui nécessite des requêtes réseau vers les serveurs des canaux de notification respectifs, il ne collecte, n’enregistre ni ne stocke aucune information. À propos du développeur Bonjour, je suis MorCherlf. Je suis programmeur, joueur, passionné de musique, Furry et plus encore…\nCeci est mon premier plugin pour Dalamud. Si vous avez des suggestions ou des questions, n’hésitez pas à soumettre un Issue ou une Pull Request sur GitHub.\nSi vous avez des questions, vous pouvez également me contacter par email.\nAvis de droits d’auteur et clause de non-responsabilité Avis de droits d’auteur Licence open source Ce plugin est open source sous la licence AGPL-3.0. Vous êtes libre d’utiliser, de modifier et de distribuer ce plugin, à condition de respecter les termes de la licence AGPL-3.0.\nGénération du site web et thème Ce site web est généré avec Hugo, et le thème est basé sur hextra.\nCanaux de notification Les canaux de notification utilisés par ce plugin sont fournis par leurs plateformes/fournisseurs de services respectifs, y compris, mais sans s’y limiter, Bark, PushDeer et Telegram Bot. Ces plateformes/fournisseurs de services conservent les droits de propriété intellectuelle et les responsabilités de leurs services.\nMarque déposée FINAL FANTASY FINAL FANTASY est une marque déposée de Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Tous droits réservés. Nous ne sommes pas affiliés à SQUARE ENIX CO., LTD.\nClause de non-responsabilité Risques liés à l’utilisation du plugin En utilisant ce plugin, vous reconnaissez et acceptez les Conditions d’utilisation de Final Fantasy XIV (FFXIV). Veuillez noter que, techniquement, ce plugin pourrait violer les Conditions d’utilisation de FFXIV, même si nous n’effectuons aucune opération automatisée ou modification du jeu. Vous assumez tous les risques associés à l’utilisation de ce plugin, y compris, mais sans s’y limiter, la suspension de compte, la perte de données ou d’autres conséquences.\nLimitation de responsabilité Les développeurs et contributeurs de ce plugin ne sont pas responsables des dommages directs ou indirects résultant de l’utilisation de ce plugin, y compris, mais sans s’y limiter, la suspension de compte, la perte de données, les dommages matériels ou d’autres responsabilités légales ou financières.\nUtilisation à vos propres risques En utilisant ce plugin, vous reconnaissez et acceptez les risques mentionnés ci-dessus et acceptez d’assumer toutes les conséquences possibles. Nous recommandons d’utiliser le plugin avec prudence et de respecter les Conditions d’utilisation de FFXIV.","à-propos-de-dutypusher#À propos de DutyPusher":"","à-propos-du-développeur#À propos du développeur":""},"title":"À propos"},"/FFXIVDutyPusher/fr/docs/":{"data":{"":"","configuration-des-canaux-de-notification#Configuration des Canaux de Notification":"Actuellement, DutyPusher prend en charge les canaux de notification suivants : Bark, PushDeer et API Officielle Telegram Bot.\nSi vous souhaitez ajouter le support d’une nouvelle plateforme, veuillez soumettre un Issue à ce dépôt.\nLiens des dépôts : Bark | PushDeer\nBot Telegram : API Telegram Bot\nSi vous rencontrez des problèmes lors de l’utilisation de ce plugin, veuillez ne pas envoyer de commentaires à aucun canal de notification ou plateforme.\nNe partagez pas votre URL/Clé de canal avec qui que ce soit !\nConfiguration de Bark Recherchez Bark dans l’App Store et installez-le.\nOuvrez l’application Bark, cliquez sur Enregistrer l’appareil et autorisez-la à envoyer des notifications.\nCopiez la première URL dans Bark et collez-la dans le champ URL/Clé du canal dans les paramètres de DutyPusher. Cliquez sur Enregistrer pour commencer à l’utiliser.\nConfigurations Optionnelles\nVous pouvez activer Notifications Urgentes dans les paramètres du plugin pour recevoir des notifications push même lorsque votre appareil est en mode Focus. Dans Bark, cliquez sur Voir tous les sons et importez ce Son de Duty. Assurez-vous de renommer le fichier en ff14.caf avant de l’importer. Configuration de PushDeer iOS/iPadOS (14+)\nUtilisez l’appareil photo de votre système pour scanner le code App Clip ci-dessous et commencer à utiliser PushDeer.\nAlternativement, recherchez PushDeer dans l’App Store et installez-le.\nOuvrez l’application PushDeer, allez dans l’onglet Appareils, cliquez sur le bouton plus (+) en haut à droite et autorisez-la à envoyer des notifications.\nAllez dans l’onglet Clé dans PushDeer, copiez votre clé et collez-la dans le champ URL/Clé du canal dans les paramètres de DutyPusher. Cliquez sur Enregistrer pour commencer à l’utiliser.\nConfiguration de l’API Officielle Telegram Bot Documentation Officielle : API Telegram Bot\nLes étapes suivantes peuvent changer à tout moment. Veuillez vous référer à la documentation officielle de Telegram pour les instructions les plus récentes.\nCréation d’un Bot Utilisez votre compte Telegram pour envoyer la commande /start à @BotFather. Ensuite, envoyez la commande /newbot et suivez les instructions pour définir un nom et un nom d’utilisateur pour votre bot. Vous recevrez des informations détaillées sur votre bot, y compris un lien vers votre bot (commençant par t.me/) et un token (commençant par des chiffres : 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Paramètres du Plugin Envoyez la commande /start à votre bot nouvellement créé dans Telegram. Copiez le token fourni par BotFather et collez-le dans le champ Token dans les paramètres de DutyPusher. Cliquez sur Obtenir l’ID de chat et attendez que l’ID de chat soit automatiquement rempli. Une fois l’ID de chat récupéré, cliquez sur Tester pour confirmer que vous pouvez recevoir un message de votre bot dans Telegram. Si tout fonctionne, cliquez sur Enregistrer pour commencer à l’utiliser. Tip\nSi le plugin ne parvient pas à récupérer automatiquement votre ID de chat, essayez les étapes suivantes :\nAssurez-vous que le token est correctement entré. Envoyez un message à votre bot et essayez de récupérer à nouveau l’ID de chat. Si les étapes ci-dessus ne fonctionnent pas :\nOuvrez votre navigateur et visitez l’URL suivante : https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Remarque : Remplacez $YOUR_BOT_TOKEN_HERE par votre token de bot. Localisez le champ message -\u003e chat -\u003e id dans la réponse JSON et copiez-le dans le champ ID de chat dans les paramètres du plugin. ","paramètres-du-plugin#Paramètres du Plugin":"Vous pouvez ouvrir la page des paramètres de DutyPusher de l’une des manières suivantes :\nCliquez sur le bouton des paramètres de DutyPusher dans le Centre de Plugins. Entrez la commande /dutypusher dans le jeu. Tout d’abord, sélectionnez le canal de notification que vous souhaitez utiliser dans le menu déroulant.\nEnsuite, remplissez le Token/URL/Clé requis pour le canal de notification sélectionné, activez le plugin et enregistrez les paramètres pour commencer à l’utiliser.\nAprès avoir configuré le canal de notification, vous pouvez vérifier l’état d’activation de DutyPusher dans la Barre DTR en haut à droite de l’interface principale du jeu. Cliquez sur l’icône d’état pour l’activer ou le désactiver."},"title":"Guide de Configuration"},"/FFXIVDutyPusher/fr/faq/":{"data":{"":" Q : Pourquoi je ne reçois pas de notifications push ?\nR : Veuillez vérifier si le canal de notification est correctement configuré et assurez-vous que votre appareil autorise les notifications.\nQ : Comment désinstaller le plugin ?\nR : Trouvez DutyPusher dans le Centre de Plugins, désactivez-le, puis cliquez sur le bouton Supprimer.\nQ : Pouvez-vous ajouter le support pour le canal de notification [XX] ?\nR : Veuillez soumettre un Issue à ce dépôt avec le nom de la plateforme/canal de notification, et nous essaierons de l’ajouter au plugin."},"title":"FAQ"}}