{"/FFXIVDutyPusher/it/about/":{"data":{"":"","diritti-dautore-e-dichiarazione-di-non-responsabilità#Diritti d\u0026rsquo;autore e dichiarazione di non responsabilità":"Informazioni su DutyPusher DutyPusher è un plugin open source per Dalamud sviluppato da MorCherlf per Final Fantasy XIV (FFXIV). Il suo obiettivo è aiutare i giocatori a rilassarsi lontano dai propri computer mentre aspettano in coda per i dungeon. Utilizzando più canali di notifica estensibili, i giocatori possono ricevere avvisi immediati quando la loro coda è pronta, assicurandosi di non perdere nessun dungeon.\nCaratteristiche principali\nSupporto per più canali di notifica: Attualmente supporta le API ufficiali di Bark, PushDeer e Telegram Bot, con piani per espandersi a più canali di notifica in futuro. Notifiche istantanee: Quando la tua coda per il dungeon è pronta, DutyPusher invierà immediatamente una notifica al tuo dispositivo. Facile da usare: Una configurazione semplice ti permette di iniziare a usarlo subito. Opzioni personalizzabili: Supporta suoni di notifica personalizzati e notifiche istantanee (Bark). Completamente open source: DutyPusher è completamente open source. Puoi creare il tuo fork o inviarci una Pull Request. Il più sicuro possibile: DutyPusher non interagisce con il server di gioco né modifica/opera il gioco in alcun modo. Tranne per l’invio di notifiche, che richiede richieste di rete ai server dei rispettivi canali di notifica, non raccoglie, registra o memorizza alcuna informazione. Informazioni sullo sviluppatore Ciao, sono MorCherlf. Sono un programmatore, giocatore, appassionato di musica, Furry e altro ancora…\nQuesto è il mio primo plugin per Dalamud. Se hai suggerimenti o domande, sentiti libero di inviare un Issue o una Pull Request su GitHub.\nSe hai domande, puoi anche contattarmi via email.\nDiritti d’autore e dichiarazione di non responsabilità Avviso sui diritti d’autore Licenza open source Questo plugin è open source sotto la licenza AGPL-3.0. Sei libero di usare, modificare e distribuire questo plugin, a patto di rispettare i termini della licenza AGPL-3.0.\nGenerazione del sito web e tema Questo sito web è generato con Hugo, e il tema è basato su hextra.\nCanali di notifica I canali di notifica utilizzati da questo plugin sono forniti dalle rispettive piattaforme/fornitori di servizi, tra cui, ma non limitati a, Bark, PushDeer e Telegram Bot. Queste piattaforme/fornitori di servizi conservano i diritti di proprietà intellettuale e le responsabilità dei loro servizi.\nMarchio FINAL FANTASY FINAL FANTASY è un marchio registrato di Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Tutti i diritti riservati. Non siamo affiliati con SQUARE ENIX CO., LTD.\nDichiarazione di non responsabilità Rischi legati all’uso del plugin Utilizzando questo plugin, riconosci e accetti i Termini di Servizio di Final Fantasy XIV (FFXIV). Tieni presente che, tecnicamente, questo plugin potrebbe violare i Termini di Servizio di FFXIV, anche se non eseguiamo operazioni automatizzate o modifiche al gioco. Accetti tutti i rischi associati all’uso di questo plugin, inclusi, ma non limitati a, la sospensione dell’account, la perdita di dati o altre conseguenze.\nLimitazione di responsabilità Gli sviluppatori e i collaboratori di questo plugin non sono responsabili per eventuali danni diretti o indiretti derivanti dall’uso di questo plugin, inclusi, ma non limitati a, la sospensione dell’account, la perdita di dati, danni al dispositivo o altre responsabilità legali o finanziarie.\nUtilizzo a proprio rischio Utilizzando questo plugin, riconosci e accetti i rischi menzionati sopra e accetti di assumerti tutte le possibili conseguenze. Ti raccomandiamo di usare il plugin con cautela e di rispettare i Termini di Servizio di FFXIV.\nFammi sapere se hai bisogno di ulteriori modifiche!","informazioni-su-dutypusher#Informazioni su DutyPusher":"","informazioni-sullo-sviluppatore#Informazioni sullo sviluppatore":""},"title":"Informazioni"},"/FFXIVDutyPusher/it/docs/":{"data":{"":"","configurazione-dei-canali-di-notifica#Configurazione dei Canali di Notifica":"Attualmente, DutyPusher supporta i seguenti canali di notifica: Bark, PushDeer e API Ufficiale Telegram Bot.\nSe desideri aggiungere il supporto per una nuova piattaforma, invia un Issue a questo repository.\nLink ai repository: Bark | PushDeer\nTelegram Bot: API Telegram Bot\nSe riscontri problemi durante l’uso di questo plugin, non inviare feedback a nessun canale di notifica/piattaforma.\nNon condividere il tuo URL/Chiave del canale con nessuno!\nConfigurazione di Bark Cerca Bark nell’App Store e installalo.\nApri l’app Bark, clicca su Registra Dispositivo e consenti l’invio di notifiche.\nCopia il primo URL in Bark e incollalo nel campo URL/Chiave del canale nelle impostazioni di DutyPusher. Clicca su Salva per iniziare a utilizzarlo.\nConfigurazioni Opzionali\nPuoi abilitare Notifiche Tempodipendenti nelle impostazioni del plugin per ricevere notifiche push anche quando il dispositivo è in Modalità Focus. In Bark, clicca su Visualizza Tutti i Suoni e importa questo Suono del Dungeon. Assicurati di rinominare il file in ff14.caf prima di importarlo. Configurazione di PushDeer iOS/iPadOS (14+)\nUsa la fotocamera del tuo sistema per scansionare il codice App Clip qui sotto per iniziare a utilizzare PushDeer.\nIn alternativa, cerca PushDeer nell’App Store e installalo.\nApri l’app PushDeer, vai alla scheda Dispositivi, clicca sul pulsante più (+) in alto a destra e consenti l’invio di notifiche.\nVai alla scheda Chiave in PushDeer, copia la tua chiave e incollala nel campo URL/Chiave del canale nelle impostazioni di DutyPusher. Clicca su Salva per iniziare a utilizzarlo.\nConfigurazione dell’API Ufficiale Telegram Bot Documentazione Ufficiale: API Telegram Bot\nI seguenti passaggi potrebbero cambiare in qualsiasi momento. Fai riferimento alla documentazione ufficiale di Telegram per le istruzioni più recenti.\nCreazione di un Bot Usa il tuo account Telegram per inviare il comando `/start** a @BotFather. Invia poi il comando `/newbot** e segui le istruzioni per impostare un nome e un username per il tuo bot. Riceverai informazioni dettagliate sul tuo bot, inclusi un link al tuo bot (che inizia con t.me/) e un token (che inizia con numeri: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Impostazioni del Plugin Invia il comando `/start** al tuo bot appena creato su Telegram. Copia il token fornito da BotFather e incollalo nel campo Token nelle impostazioni di DutyPusher. Clicca su Ottieni Chat ID e attendi che il Chat ID venga compilato automaticamente. Una volta ottenuto il Chat ID, clicca su Test per confermare che puoi ricevere un messaggio dal tuo bot su Telegram. Se tutto funziona, clicca su Salva per iniziare a utilizzarlo. Tip\nSe il plugin non riesce a recuperare automaticamente il tuo Chat ID, prova i seguenti passaggi:\nAssicurati che il token sia inserito correttamente. Invia un messaggio qualsiasi al tuo bot e prova a recuperare nuovamente il Chat ID. Se i passaggi sopra non funzionano:\nApri il tuo browser e visita il seguente URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Nota: Sostituisci $YOUR_BOT_TOKEN_HERE con il token del tuo bot. Trova il campo message -\u003e chat -\u003e id nella risposta JSON e copialo nel campo Chat ID nelle impostazioni del plugin. ","impostazioni-del-plugin#Impostazioni del Plugin":"Puoi aprire la pagina delle impostazioni di DutyPusher in uno dei seguenti modi:\nClicca sul pulsante delle impostazioni di DutyPusher nel Centro Plugin. Inserisci il comando /dutypusher nel gioco. Per prima cosa, seleziona il canale di notifica che desideri utilizzare dal menu a tendina.\nSuccessivamente, inserisci il Token/URL/Chiave richiesto per il canale di notifica selezionato, abilita il plugin e salva le impostazioni per iniziare a utilizzarlo.\nDopo aver configurato il canale di notifica, puoi verificare lo stato di attivazione di DutyPusher nella Barra DTR nell’angolo superiore destro dell’interfaccia principale del gioco. Clicca sull’icona dello stato per attivarlo o disattivarlo."},"title":"Guida alle Impostazioni"},"/FFXIVDutyPusher/it/faq/":{"data":{"":" D: Perché non ricevo notifiche push?\nR: Controlla se il canale di notifica è configurato correttamente e assicurati che il tuo dispositivo consenta le notifiche.\nD: Come posso disinstallare il plugin?\nR: Trova DutyPusher nel Centro Plugin, disabilitalo e poi clicca sul pulsante Elimina.\nD: Puoi aggiungere il supporto per il canale di notifica [XX]?\nR: Invia un Issue a questo repository con il nome del canale di notifica/piattaforma, e cercheremo di aggiungerlo al plugin."},"title":"FAQ"}}