{"/FFXIVDutyPusher/ja/about/":{"data":{"":"","dutypusherについて#DutyPusherについて":"DutyPusherは、MorCherlfによって開発されたFinal Fantasy XIV（FFXIV）向けのオープンソースのDalamudプラグインです。このプラグインは、ダンジョンの待機中にプレイヤーがコンピューターから離れてリラックスできるよう支援することを目的としています。複数の拡張可能なプッシュ通知チャネルを利用することで、プレイヤーは待機が完了した際に即座に通知を受け取り、ダンジョンを見逃すことがないようにします。\n主な機能\n複数のプッシュ通知チャネルをサポート：現在、Bark、PushDeer、Telegram Botの公式APIをサポートしており、将来的にはさらに多くのプッシュ通知チャネルに対応する予定です。 即時通知：ダンジョンの待機が完了すると、DutyPusherはすぐにデバイスに通知を送信します。 使いやすい：簡単な設定で、すぐに使い始めることができます。 カスタマイズ可能なオプション：カスタム通知音や即時通知（Bark）をサポートしています。 完全なオープンソース：DutyPusherは完全にオープンソースです。独自のフォークを作成したり、Pull Requestを送信したりすることができます。 可能な限り安全：DutyPusherはゲームサーバーとやり取りせず、ゲームを直接変更/操作しません。通知を送信するためにそれぞれのプッシュ通知チャネルサーバーへのネットワークリクエストが必要な場合を除き、情報を収集、記録、保存することはありません。 ","著作権と免責事項#著作権と免責事項":"著作権について オープンソースライセンス このプラグインは、AGPL-3.0ライセンスの下でオープンソースとして提供されています。AGPL-3.0ライセンスの条件に従う限り、このプラグインを自由に使用、変更、配布することができます。\nウェブサイトの生成とテーマ このウェブサイトはHugoで生成されており、テーマはhextraをベースにしています。\nプッシュ通知チャネル このプラグインで使用されるプッシュ通知チャネルは、Bark、PushDeer、Telegram Botなどの各プラットフォーム/サービスプロバイダーによって提供されています。これらのプラットフォーム/サービスプロバイダーは、それぞれのサービスに対する独立した知的財産権と責任を保持しています。\nFINAL FANTASYの商標 FINAL FANTASYはSquare Enix Holdings Co., Ltd.の登録商標です。FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. All rights reserved. 私たちはSQUARE ENIX CO., LTD.とは提携していません。\n免責事項 プラグイン使用のリスク このプラグインを使用する際は、Final Fantasy XIV（FFXIV）の利用規約に同意したものとみなされます。 技術的には、このプラグインはFFXIVの利用規約に違反する可能性があることにご注意ください。私たちはゲームに対する自動操作や変更を行いませんが、それでもリスクが存在します。 このプラグインの使用に伴うすべてのリスク（アカウント停止、データ損失、その他の結果を含むがこれに限らない）を自己責任で負うことになります。\n責任の制限 このプラグインの開発者および貢献者は、このプラグインの使用に起因する直接的または間接的な損害（ゲームアカウントの停止、データ損失、デバイスの損傷、その他の法的または金銭的責任を含むがこれに限らない）について一切の責任を負いません。\n自己責任での使用 このプラグインを使用する際は、上記のリスクを認識し、すべての可能な結果を自己責任で負うことに同意したものとみなされます。プラグインを慎重に使用し、FFXIVの利用規約を遵守することをお勧めします。","開発者について#開発者について":"こんにちは、私はMorCherlfです。プログラマー、ゲーマー、音楽愛好家、Furryなど、多様な側面を持っています…\nこれは私にとって初めてのDalamudプラグインです。ご提案や質問があれば、GitHubでIssueやPull Requestを送信してください。\n質問がある場合は、メールでもご連絡いただけます。"},"title":"について"},"/FFXIVDutyPusher/ja/docs/":{"data":{"":"","プッシュチャネル設定#プッシュチャネル設定":"現在、DutyPusherは以下のプッシュチャネルをサポートしています: Bark、PushDeer、Telegram Bot公式API。\n新しいプラットフォームのサポートを追加したい場合は、このリポジトリにIssueを提出してください。\nリポジトリリンク: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nこのプラグインの使用中に問題が発生した場合、プッシュチャネル/プラットフォームにフィードバックを送信しないでください。\nチャネルURL/Keyを他人と共有しないでください！\nBark設定 App StoreでBarkを検索してインストールしてください。\nBarkアプリを開き、Register Deviceをクリックして通知の送信を許可します。\nBarkの最初のURLをコピーし、DutyPusher設定のChannel URL/Key欄に貼り付けて、Saveをクリックすると使用を開始できます。\nオプション設定\nプラグイン設定でTime Sensitive Notificationsを有効にすると、デバイスがフォーカスモード中でもプッシュ通知を受信できます。 BarkでView All Soundsをクリックし、このダンジョン音をインポートしてください。インポート前にファイル名をff14.cafに変更してください。 PushDeer設定 iOS/iPadOS (14+)\nシステムカメラで以下のApp ClipコードをスキャンしてPushDeerを使用開始できます。\nまたは、App StoreでPushDeerを検索してインストールしてください。\nPushDeerアプリを開き、Devicesタブで右上のプラス（+）ボタンをクリックして通知の送信を許可します。\nPushDeerのKeyタブでキーをコピーし、DutyPusher設定のChannel URL/Key欄に貼り付けて、Saveをクリックすると使用を開始できます。\nTelegram Bot公式API設定 公式ドキュメント: Telegram Bot API\n以下の手順は変更される可能性があります。最新の手順についてはTelegramの公式ドキュメントを参照してください。\nBotの作成 Telegramアカウントで@BotFatherに/startコマンドを送信します。 次に/newbotコマンドを送信し、指示に従ってBotの名前とユーザー名を設定します。 Botの詳細情報が送信されます。これにはBotへのリンク（t.me/で始まる）とトークン（数字で始まる: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx）が含まれます。 プラグイン設定 Telegramで新しく作成したBotに/startコマンドを送信します。 BotFatherから提供されたトークンをコピーし、DutyPusher設定のToken欄に貼り付けます。Get Chat IDをクリックし、Chat IDが自動的に入力されるのを待ちます。 Chat IDが取得されたら、TestをクリックしてTelegramでBotからのメッセージを受信できるか確認します。すべて正常に動作する場合、Saveをクリックして使用を開始できます。 Tip\nプラグインが自動的にChat IDを取得できない場合、以下の手順を試してください:\nトークンが正しく入力されていることを確認します。 Botに任意のメッセージを送信し、再度Chat IDを取得してみます。 上記の手順でも解決しない場合:\nブラウザで以下のURLにアクセスします: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates 注: $YOUR_BOT_TOKEN_HEREをBotのトークンに置き換えてください。 JSONレスポンス内のmessage -\u003e chat -\u003e idフィールドを見つけ、プラグイン設定のChat ID欄にコピーします。 ","プラグイン設定#プラグイン設定":"DutyPusherの設定ページは以下の方法で開くことができます:\nプラグインセンターでDutyPusherの設定ボタンをクリックする。 ゲーム内で/dutypusherコマンドを入力する。 まず、ドロップダウンメニューから使用したいプッシュチャネルを選択してください。\n次に、選択したプッシュチャネルに必要なToken/URL/Keyを入力し、プラグインを有効にして設定を保存すると使用を開始できます。\nプッシュチャネルの設定が完了したら、ゲームのメインインターフェースの右上にあるDTR BarでDutyPusherの有効状態を確認できます。ステータスアイコンをクリックして有効/無効を切り替えてください。"},"title":"設定ガイド"},"/FFXIVDutyPusher/ja/faq/":{"data":{"":" Q: プッシュ通知が届かないのはなぜですか？\nA: プッシュチャネルが正しく設定されているか確認し、デバイスが通知を許可しているか確認してください。\nQ: プラグインをアンインストールするにはどうすればいいですか？\nA: プラグインセンターでDutyPusherを見つけ、無効にしてから削除ボタンをクリックしてください。\nQ: ○○プッシュチャネルのサポートを追加できますか？\nA: プッシュチャネル名/プラットフォームを記載して、このリポジトリにIssueを提出してください。プラグインに追加できるよう検討します。"},"title":"よくある質問"}}