{"/FFXIVDutyPusher/nor/about/":{"data":{"":"","om-dutypusher#Om DutyPusher":"DutyPusher er en open-source Dalamud-plug-in utviklet av MorCherlf for Final Fantasy XIV (FFXIV). Den har som mål å hjelpe spillere å slappe av bort fra datamaskinen mens de venter i kø til dungeons. Ved å bruke flere utvidbare push-kanaler kan spillere motta umiddelbare varsler når køen deres er klar, noe som sikrer at de ikke går glipp av en dungeon.\nNøkkelfunksjoner\nStøtte for flere push-kanaler: Støtter for øyeblikket Bark, PushDeer og Telegram Bot offisielle API-er, med planer om å utvide til flere push-kanaler i fremtiden. Umiddelbare varsler: Når dungeon-køen din er klar, sender DutyPusher umiddelbart et varsel til enheten din. Enkel å bruke: Enkel oppsett gjør det mulig å begynne å bruke den med en gang. Tilpassbare alternativer: Støtter egendefinerte varsellyder og umiddelbare varsler (Bark). Fullstendig open-source: DutyPusher er fullstendig open-source. Du kan lage din egen forgrening eller sende en Pull Request til oss. Så sikker som mulig: DutyPusher samhandler ikke med spillserveren eller endrer/opererer spillet direkte på noen måte. Bortsett fra å sende varsler, som krever nettverksforespørsler til de respektive push-kanalserverne, samler den ikke inn, registrerer eller lagrer noen informasjon. ","om-utvikleren#Om utvikleren":"Hei, jeg er MorCherlf. Jeg er en programmerer, gamer, musikkentusiast, Furry og mer…\nDette er min første Dalamud-plug-in. Hvis du har noen forslag eller spørsmål, kan du gjerne sende en Issue eller Pull Request på GitHub.\nHvis du har noen spørsmål, kan du også nå meg via e-post.","opphavsrett-og-ansvarsfraskrivelse#Opphavsrett og ansvarsfraskrivelse":"Opphavsrettsmerknad Open-source-lisens Denne plug-inen er open-source under AGPL-3.0-lisensen. Du har frihet til å bruke, endre og distribuere denne plug-inen, forutsatt at du overholder vilkårene i AGPL-3.0-lisensen.\nGenerering av nettsted og tema Dette nettstedet er generert av Hugo, og temaet er basert på hextra.\nPush-kanaler Push-kanalene som brukes av denne plug-inen, leveres av sine respektive plattformer/tjenesteleverandører, inkludert, men ikke begrenset til, Bark, PushDeer og Telegram Bot. Disse plattformene/tjenesteleverandørene beholder uavhengige intellektuelle eiendomsrettigheter og ansvar for sine tjenester.\nFINAL FANTASY-varemerke FINAL FANTASY er et registrert varemerke for Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Alle rettigheter forbeholdt. Vi er ikke tilknyttet SQUARE ENIX CO., LTD.\nAnsvarsfraskrivelse Risiko ved bruk av plug-in Ved å bruke denne plug-inen erkjenner og godtar du bruksvilkårene for Final Fantasy XIV (FFXIV). Vær oppmerksom på at denne plug-inen teknisk sett kan bryte FFXIVs bruksvilkår, selv om vi ikke utfører noen automatiserte operasjoner eller endringer i spillet. Du påtar deg alle risikoer knyttet til bruken av denne plug-inen, inkludert, men ikke begrenset til, kontostans, datatap eller andre konsekvenser.\nBegrensning av ansvar Utviklere og bidragsytere til denne plug-inen er ikke ansvarlige for noen direkte eller indirekte skader som oppstår fra bruken av denne plug-inen, inkludert, men ikke begrenset til, kontostans, datatap, skade på enheter eller andre juridiske eller økonomiske forpliktelser.\nBruk på eget ansvar Ved å bruke denne plug-inen erkjenner og godtar du risikoene nevnt ovenfor og samtykker i å bære alle mulige konsekvenser. Vi anbefaler å bruke plug-inen med forsiktighet og overholde FFXIVs bruksvilkår."},"title":"Om"},"/FFXIVDutyPusher/nor/docs/":{"data":{"":"","pluggin-innstillinger#Pluggin-innstillinger":"Du kan åpne innstillingssiden for DutyPusher på en av følgende måter:\nKlikk på DutyPusher-innstillingsknappen i Plugin-senteret. Skriv inn kommandoen /dutypusher i spillet. Først, velg push-kanalen du ønsker å bruke fra rullegardinmenyen.\nDeretter, fyll ut den nødvendige Token/URL/Nøkkel for den valgte push-kanalen, aktiver plugginen, og lagre innstillingene for å begynne å bruke den.\nEtter at du har konfigurert push-kanalen, kan du sjekke aktivitetsstatusen til DutyPusher i DTR Bar øverst til høyre i spillets hovedgrensesnitt. Klikk på statusikonet for å slå den av eller på.","push-kanal-konfigurasjon#Push-kanal konfigurasjon":"For øyeblikket støtter DutyPusher følgende push-kanaler: Bark, PushDeer, og Telegram Bot Offisiell API.\nHvis du ønsker å legge til støtte for en ny plattform, vennligst send inn en Issue til dette repositoryet.\nRepo-lenker: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nHvis du opplever problemer mens du bruker denne plugginen, vennligst ikke send tilbakemelding til noen push-kanal/plattform.\nDel ikke kanal-URL/Nøkkel med noen!\nBark konfigurasjon Søk etter Bark i App Store og installer den.\nÅpne Bark-appen, klikk på Registrer enhet, og tillat den å sende varsler.\nKopier den første URL-en i Bark og lim den inn i Kanal-URL/Nøkkel-feltet i DutyPusher-innstillingene. Klikk på Lagre for å begynne å bruke den.\nValgfrie konfigurasjoner\nDu kan aktivere Tidsfølsomme varsler i pluggin-innstillingene for å motta push-varsler selv når enheten din er i Fokus-modus. I Bark, klikk på Vis alle lyder og importer denne Duty-lyden. Sørg for å omdøpe filen til ff14.caf før du importerer den. PushDeer konfigurasjon iOS/iPadOS (14+)\nBruk systemkameraet ditt til å skanne App Clip-koden under for å begynne å bruke PushDeer.\nAlternativt, søk etter PushDeer i App Store og installer den.\nÅpne PushDeer-appen, gå til Enheter-fanen, klikk på pluss (+) -knappen øverst til høyre, og tillat den å sende varsler.\nGå til Nøkkel-fanen i PushDeer, kopier nøkkelen din, og lim den inn i Kanal-URL/Nøkkel-feltet i DutyPusher-innstillingene. Klikk på Lagre for å begynne å bruke den.\nTelegram Bot Offisiell API konfigurasjon Offisiell dokumentasjon: Telegram Bot API\nFølgende trinn kan endres når som helst. Vennligst se den offisielle Telegram-dokumentasjonen for de siste instruksjonene.\nOpprette en bot Bruk Telegram-kontoen din til å sende /start-kommandoen til @BotFather. Send deretter /newbot-kommandoen og følg instruksjonene for å sette et navn og brukernavn for boten din. Du vil motta detaljert informasjon om boten din, inkludert en lenke til boten din (starter med t.me/) og en token (starter med tall: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Pluggin-innstillinger Send /start-kommandoen til den nylig opprettede boten din i Telegram. Kopier tokenen som ble gitt av BotFather og lim den inn i Token-feltet i DutyPusher-innstillingene. Klikk på Hent Chat ID og vent til Chat ID-en automatisk fylles ut. Når Chat ID-en er hentet, klikk på Test for å bekrefte at du kan motta en melding fra boten din i Telegram. Hvis alt fungerer, klikk på Lagre for å begynne å bruke den. Tip\nHvis plugginen ikke automatisk kan hente Chat ID-en din, prøv følgende trinn:\nSørg for at tokenen er skrevet inn riktig. Send en hvilken som helst melding til boten din og prøv å hente Chat ID-en på nytt. Hvis trinnene ovenfor ikke fungerer:\nÅpne nettleseren din og besøk følgende URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Merk: Erstatt $YOUR_BOT_TOKEN_HERE med bot-tokenen din. Finn message -\u003e chat -\u003e id-feltet i JSON-svaret og kopier det inn i Chat ID-feltet i pluggin-innstillingene. "},"title":"Installasjonsveiledning"},"/FFXIVDutyPusher/nor/faq/":{"data":{"":" Q: Hvorfor mottar jeg ikke push-varsler?\nA: Vennligst sjekk om push-kanalen er konfigurert riktig og forsikre deg om at enheten din tillater varsler.\nQ: Hvordan avinstallerer jeg plugginen?\nA: Finn DutyPusher i Plugin-senteret, deaktiver den, og klikk deretter på Slett-knappen.\nQ: Kan du legge til støtte for [XX] push-kanal?\nA: Vennligst send inn en Issue til dette repositoryet med navnet på push-kanalen/plattformen, så vil vi prøve å legge den til i plugginen."},"title":"FAQ"}}