{"/FFXIVDutyPusher/ru/about/":{"data":{"":"","авторские-права-и-отказ-от-ответственности#Авторские права и отказ от ответственности":"Уведомление об авторских правах Открытая лицензия Этот плагин распространяется под лицензией AGPL-3.0. Вы можете свободно использовать, изменять и распространять этот плагин при условии соблюдения условий лицензии AGPL-3.0.\nГенерация сайта и тема Этот сайт создан с помощью Hugo, а тема основана на hextra.\nКаналы уведомлений Каналы уведомлений, используемые этим плагином, предоставляются соответствующими платформами/провайдерами услуг, включая, но не ограничиваясь, Bark, PushDeer и Telegram Bot. Эти платформы/провайдеры сохраняют независимые права на интеллектуальную собственность и ответственность за свои услуги.\nТоварный знак FINAL FANTASY FINAL FANTASY является зарегистрированным товарным знаком Square Enix Holdings Co., Ltd. FINAL FANTASY XIV © 2010-2022 SQUARE ENIX CO., LTD. Все права защищены. Мы не связаны с SQUARE ENIX CO., LTD.\nОтказ от ответственности Риски использования плагина Используя этот плагин, вы признаете и соглашаетесь с Условиями обслуживания Final Fantasy XIV (FFXIV). Обратите внимание, что технически этот плагин может нарушать Условия обслуживания FFXIV, даже если мы не выполняем никаких автоматизированных операций или изменений в игре. Вы принимаете на себя все риски, связанные с использованием этого плагина, включая, но не ограничиваясь, блокировкой аккаунта, потерей данных или другими последствиями.\nОграничение ответственности Разработчики и участники этого плагина не несут ответственности за любые прямые или косвенные убытки, возникшие в результате использования этого плагина, включая, но не ограничиваясь, блокировкой аккаунта, потерей данных, повреждением устройств или другими юридическими или финансовыми обязательствами.\nИспользование на свой страх и риск Используя этот плагин, вы признаете и принимаете указанные выше риски и соглашаетесь нести все возможные последствия. Мы рекомендуем использовать плагин с осторожностью и соблюдать Условия обслуживания FFXIV.","о-dutypusher#О DutyPusher":"DutyPusher — это открытый плагин для Dalamud, разработанный MorCherlf для Final Fantasy XIV (FFXIV). Он призван помочь игрокам расслабиться вдали от компьютера, ожидая своей очереди на подземелья. Используя несколько расширяемых каналов уведомлений, игроки могут получать мгновенные оповещения, когда их очередь подходит, чтобы не пропустить вход в подземелье.\nОсновные функции\nПоддержка нескольких каналов уведомлений: В настоящее время поддерживаются официальные API Bark, PushDeer и Telegram Bot, с планами расширения на большее количество каналов в будущем. Мгновенные уведомления: Когда ваша очередь на подземелье подходит, DutyPusher сразу же отправляет уведомление на ваше устройство. Простота в использовании: Простая настройка позволяет начать использование сразу же. Настраиваемые опции: Поддерживает пользовательские звуки уведомлений и мгновенные уведомления (Bark). Полностью открытый код: DutyPusher полностью открыт. Вы можете создать свою собственную версию или отправить Pull Request нам. Максимальная безопасность: DutyPusher не взаимодействует с игровым сервером и не изменяет/управляет игрой напрямую. За исключением отправки уведомлений, которые требуют сетевых запросов к серверам соответствующих каналов уведомлений, плагин не собирает, не записывает и не хранит никакой информации. ","о-разработчике#О разработчике":"Привет, я MorCherlf. Я программист, геймер, любитель музыки, фурри и многое другое…\nЭто мой первый плагин для Dalamud. Если у вас есть предложения или вопросы, не стесняйтесь отправить Issue или Pull Request на GitHub.\nЕсли у вас есть вопросы, вы также можете связаться со мной по электронной почте."},"title":"О проекте"},"/FFXIVDutyPusher/ru/docs/":{"data":{"":"","настройка-каналов-уведомлений#Настройка каналов уведомлений":"В настоящее время DutyPusher поддерживает следующие каналы уведомлений: Bark, PushDeer и Официальный API Telegram Bot.\nЕсли вы хотите добавить поддержку новой платформы, пожалуйста, отправьте Issue в этот репозиторий.\nСсылки на репозитории: Bark | PushDeer\nTelegram Bot: Telegram Bot API\nЕсли вы столкнулись с проблемами при использовании этого плагина, пожалуйста, не отправляйте отзывы на любой канал уведомлений/платформу.\nНе делитесь своим URL/Key канала с кем-либо!\nНастройка Bark Найдите Bark в App Store и установите его.\nОткройте приложение Bark, нажмите Register Device и разрешите отправку уведомлений.\nСкопируйте первый URL в Bark и вставьте его в поле Channel URL/Key в настройках DutyPusher. Нажмите Сохранить, чтобы начать использование.\nДополнительные настройки\nВы можете включить Срочные уведомления в настройках плагина, чтобы получать push-уведомления, даже если ваше устройство находится в режиме “Не беспокоить”. В Bark нажмите View All Sounds и импортируйте этот Звук Duty. Убедитесь, что переименовали файл в ff14.caf перед импортом. Настройка PushDeer iOS/iPadOS (14+)\nИспользуйте камеру вашего устройства, чтобы отсканировать App Clip Code ниже, чтобы начать использование PushDeer.\nЛибо найдите PushDeer в App Store и установите его.\nОткройте приложение PushDeer, перейдите на вкладку Devices, нажмите на плюс (+) в верхнем правом углу и разрешите отправку уведомлений.\nПерейдите на вкладку Key в PushDeer, скопируйте ваш ключ и вставьте его в поле Channel URL/Key в настройках DutyPusher. Нажмите Сохранить, чтобы начать использование.\nНастройка Официального API Telegram Bot Официальная документация: Telegram Bot API\nСледующие шаги могут измениться в любое время. Пожалуйста, обратитесь к официальной документации Telegram для получения актуальных инструкций.\nСоздание бота Используйте ваш аккаунт Telegram, чтобы отправить команду /start @BotFather. Затем отправьте команду `/newbot** и следуйте инструкциям, чтобы задать имя и username для вашего бота. Вы получите подробную информацию о вашем боте, включая ссылку на бота (начинающуюся с t.me/) и токен (начинающийся с цифр: 0000000000:xxxxxxxxxxxxxxxxxxxxxxxxxxxx). Настройки плагина Отправьте команду /start вашему новому боту в Telegram. Скопируйте токен, предоставленный BotFather, и вставьте его в поле Token в настройках DutyPusher. Нажмите Получить Chat ID и дождитесь автоматического заполнения Chat ID. После получения Chat ID нажмите Тест, чтобы убедиться, что вы можете получить сообщение от вашего бота в Telegram. Если всё работает, нажмите Сохранить, чтобы начать использование. Tip\nЕсли плагин не может автоматически получить ваш Chat ID, попробуйте следующие шаги:\nУбедитесь, что токен введён правильно. Отправьте любое сообщение вашему боту и попробуйте получить Chat ID снова. Если вышеуказанные шаги не работают:\nОткройте ваш браузер и перейдите по следующему URL: https://api.telegram.org/bot$YOUR_BOT_TOKEN_HERE/getUpdates Примечание: Замените $YOUR_BOT_TOKEN_HERE на ваш токен бота. Найдите поле message -\u003e chat -\u003e id в JSON-ответе и скопируйте его в поле Chat ID в настройках плагина. ","настройки-плагина#Настройки плагина":"Вы можете открыть страницу настроек DutyPusher одним из следующих способов:\nНажмите кнопку настроек DutyPusher в центре плагинов. Введите команду /dutypusher в игре. Сначала выберите канал уведомлений, который вы хотите использовать, из выпадающего меню.\nЗатем заполните необходимый Token/URL/Key для выбранного канала уведомлений, активируйте плагин и сохраните настройки, чтобы начать его использование.\nПосле настройки канала уведомлений вы можете проверить статус активации DutyPusher в DTR Bar в верхнем правом углу основного интерфейса игры. Нажмите на значок статуса, чтобы включить или выключить его."},"title":"Руководство по настройке"},"/FFXIVDutyPusher/ru/faq/":{"data":{"":" Вопрос: Почему я не получаю push-уведомления?\nОтвет: Пожалуйста, проверьте, правильно ли настроен канал уведомлений, и убедитесь, что ваше устройство разрешает получение уведомлений.\nВопрос: Как удалить плагин?\nОтвет: Найдите DutyPusher в центре плагинов, отключите его, а затем нажмите кнопку Удалить.\nВопрос: Можете ли вы добавить поддержку [XX] канала уведомлений?\nОтвет: Пожалуйста, отправьте Issue в этот репозиторий с указанием названия канала уведомлений/платформы, и мы постараемся добавить его в плагин."},"title":"Часто задаваемые вопросы (FAQ)"}}